{
    "COGS 1": {
        "prerequisites": [],
        "name": "Introduction to Cognitive Science",
        "description": "A team-taught course highlighting development of the field and the broad range of topics covered in the major. Example topics include addiction, analogy, animal cognition, human-computer interaction, language, neuroimaging, neural networks, reasoning, robots, and real-world applications. "
    },
    "COGS 2": {
        "prerequisites": [],
        "name": "Cognitive Neuroeconomics",
        "description": "This course is an introduction to the neuroscience behind the principles of economic decision-making. The topics in this course are aimed at exploring the underlying cognitive and neural mechanisms that drive the decisions behind traditional economic models. "
    },
    "COGS 3": {
        "prerequisites": [],
        "name": "Introduction to Computing",
        "description": "Covers the fundamental concepts that underlie all programming languages and provides an introduction to the essential information about algorithms and data structures. Students design and implement web applications using HTML5, CSS3, JavaScript, and Photoshop. No previous programming experience is required. "
    },
    "COGS 8": {
        "prerequisites": [],
        "name": "Hands-on Computing",
        "description": "Introductory-level course that will give students insight into the fundamental concepts of algorithmic thinking and design. The course will provide the students with first-person, hands-on experience programming a web crawler and simple physical robots. "
    },
    "COGS 9": {
        "prerequisites": [],
        "name": "Introduction to Data Science",
        "description": "Concepts of data and its role in science will be introduced, as well as the ideas behind data-mining, text-mining, machine learning, and graph theory, and how scientists and companies are leveraging those methods to uncover new insights into human cognition."
    },
    "COGS 10": {
        "prerequisites": [],
        "name": "Cognitive Consequences of Technology",
        "description": "This course examines the interrelationships of cognition and technology from the perspective of cognitive science. We address questions of importance for our increasingly technological society: How does technology shape our minds? How should what we know about our minds shape technology?"
    },
    "COGS 11": {
        "prerequisites": [],
        "name": "Minds and Brains",
        "description": "How damaged and normal brains influence the way humans solve problems, remember or forget, pay attention to things; how they affect our emotions, and the way we use language in daily life. "
    },
    "COGS 12": {
        "prerequisites": [],
        "name": "Language, Culture, and Cognition",
        "description": "Do people who speak different languages think differently? Does learning new languages change the way you think? Are some thoughts unthinkable without language? Course will bring together ideas and findings from psychology, linguistics, anthropology, neuroscience, and philosophy."
    },
    "COGS 13": {
        "prerequisites": [],
        "name": "Field Methods: Studying Cognition in the Wild",
        "description": "This course introduces students to multiple methods to investigate cognition and behavior in natural settings. Students will learn about ethnography, videography (video data collection, coding, and analysis), surveys design and conducting interviews, and how to move from observations to modeling."
    },
    "COGS 14A": {
        "prerequisites": [],
        "name": "Introduction to Research Methods",
        "description": "Introduction to the scientific method. Methods of knowledge acquisition, research questions, hypotheses, operational definitions, variables, control. Observation, levels of measurement, reliability, validity. Experimentation and design: between-groups, within-subjects, quasi-experimental, factorial, single-subject. Correlational and observational studies. Ethics in research."
    },
    "COGS 14B": {
        "prerequisites": [
            "COGS 14A"
        ],
        "name": "Introduction to Statistical Analysis",
        "description": "Introduction to descriptive and inferential statistics. Tables, graphs, measures of central tendency and variability. Distributions, Z-scores, correlation, regression. Probability, sampling, logic of inferential statistics, hypothesis testing, decision theory. T-test, one and two-way Anova, nonparametric tests (Chi-square). \n\t\t\t"
    },
    "COGS 15": {
        "prerequisites": [],
        "name": "What the *#!?: An Uncensored Introduction to Language",
        "description": "This course uses the study of swearing to introduce topics in language: how children learn it, why it changes over time, and how people pronounce and understand it. Students who believe they could be offended by the study of swearing and other taboo language might not find this course appropriate for them."
    },
    "COGS 17": {
        "prerequisites": [],
        "name": "Neurobiology of Cognition",
        "description": "Introduction to the organization and functions of the nervous system. Topics include molecular, cellular, developmental, systems, and behavioral neurobiology. Specifically, structure and function of neurons, peripheral and central nervous systems, sensory, motor, and control systems, learning and memory mechanisms. (Students may not receive credit for both BILD12 and COGS 17. This course fulfills general-education requirements for Marshall and Roosevelt Colleges as well as Warren by petition.) "
    },
    "COGS 18": {
        "prerequisites": [],
        "name": "Introduction to Python ",
        "description": "This class will teach fundamental Python programming skills and practices, including the “Zen of Python.” Students will focus on scientific computing and learn to write functions and tests, as well as how to debug code using the Jupyter Notebook programming environment. Students with limited computing experience may take COGS 3 for preparation."
    },
    "COGS 20": {
        "prerequisites": [],
        "name": "Exploring the Musical Mind",
        "description": "(Cross-listed with MUS 20.) How do we transform complex sounds into comprehensible and meaningful music? What physiological, neurological, cognitive, and cultural systems are involved? Why do we make music in such diverse ways around the globe? Does music have evolutionary or ecological significance? What is the relationship between music, motion, and emotions? This course explores contemporary understandings of how we hear and how we become musical and invites students to listen to new music in new ways. Students may not receive credit for both COGS 20 and MUS 20."
    },
    "COGS 87": {
        "prerequisites": [],
        "name": "Freshman Seminar",
        "description": "The Freshman Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. Freshman Seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering freshmen. "
    },
    "COGS 90": {
        "prerequisites": [],
        "name": "Undergraduate Seminar",
        "description": "Special topics in cognitive science are discussed. P/NP grades only. (May be repeated when topics vary.)"
    },
    "COGS 91": {
        "prerequisites": [],
        "name": "SCANS Presents",
        "description": "The department faculty and the Students for Cognitive and Neurosciences (SCANS) offer this seminar exploring issues in cognitive science. It includes informal faculty research presentations, investigations of topics not covered in the curriculum, and discussions on graduate school and careers. (May be repeated when topics vary.) "
    },
    "COGS 92": {
        "prerequisites": [],
        "name": "Resiliency in the Face of Adversity",
        "description": "Psychological resiliency will be addressed both scientifically and pragmatically. Students will explore the way cognitive and behavioral factors contribute to one’s ability to cope with the stresses of life and emerge from them stronger than before. P/NP only. "
    },
    "COGS 99": {
        "prerequisites": [],
        "name": "Independent Study",
        "description": "Independent literature or laboratory research by arrangement with and under direction of a Department of Cognitive Science faculty member. "
    },
    "COGS 100": {
        "prerequisites": [
            "COGS 1",
            "or",
            "COGS 10"
        ],
        "name": "Cyborgs Now and in the Future",
        "description": "Covers the theories of situated, distributed, enactive, and embodied cognition. Explains how cyborgs are a natural consequence of our current understanding of embodied minds embedded in culturally shaped niches; how mental systems can be distributed over other people and things. "
    },
    "COGS 101A": {
        "prerequisites": [
            "COGS 1"
        ],
        "name": "Sensation and Perception",
        "description": "An introduction to the experimental study of cognition with a focus on sensation and perception. "
    },
    "COGS 101B": {
        "prerequisites": [
            "COGS 1"
        ],
        "name": "Learning, Memory, and Attention",
        "description": "A survey of the experimental study of learning, memory, and attention. Topics include conditioning, automaticity, divided attention, memory systems, and the nature of mental representation. "
    },
    "COGS 101C": {
        "prerequisites": [
            "COGS 1",
            "and"
        ],
        "name": "Language",
        "description": "An introduction to structure of natural language, and to the cognitive processes that underline its acquisition, comprehension, and production. This course covers findings from linguistics, computer science, psychology, and cognitive neuroscience to provide an integrated perspective on human language abilities. "
    },
    "COGS 102A": {
        "prerequisites": [
            "COGS 1",
            "and",
            "COGS 10"
        ],
        "name": "Cognitive Perspectives ",
        "description": "Explores current theoretical frameworks of high-level human cognition that emphasize how we interact with the material, social, and cultural world. Themes include the philosophy and history of cognitive science, the role of artifacts, and how cognition extends beyond the individual. "
    },
    "COGS 102B": {
        "prerequisites": [
            "COGS 102A"
        ],
        "name": "Cognitive Ethnography",
        "description": "Examines memory, reasoning, language, culture, planning, and interaction directly in everyday, real-world settings. Focuses on ethnographic methods, their history, and their application. The course work includes projects in which students make observations of real-world activity and analyze their cognitive significance. "
    },
    "COGS 102C": {
        "prerequisites": [
            "COGS 102B"
        ],
        "name": "Cognitive Design Studio",
        "description": "This project-based course focuses on learning and applying the process of human-centered cognitive design. Students work in teams to design and evaluate a prototype application or redesign an existing system. Emphasizes contextual inquiry, user research, ideation, iterative design, and evaluation. "
    },
    "COGS 107A": {
        "prerequisites": [
            "COGS 1",
            "or",
            "COGS 17"
        ],
        "name": "Neuroanatomy and Physiology",
        "description": "This first course in the sequence focuses on principles of brain organization, from neurons to circuits to functional networks. It explores developmental plasticity, neuronal connectivity, cellular communication, complex signaling, and how these various dimensions form functional brain systems. "
    },
    "COGS 107B": {
        "prerequisites": [
            "COGS 107A"
        ],
        "name": "Systems Neuroscience",
        "description": "This course focuses on the electrical dynamics of neurons and how their patterns relate to perception, thought, and action. Neural activity patterns underlying vision, touch, audition, proprioception, and head orientation are examined in detail. Also examined are motor control, sleep/wake state production, action planning, learning, memory, attention, spatial cognition and function of the cerebellum, basal ganglia, and hippocampus. "
    },
    "COGS 107C": {
        "prerequisites": [
            "COGS 107B",
            "and"
        ],
        "name": "Cognitive Neuroscience",
        "description": "This course reviews research investigating the neural bases for human mental processes, including processing of affective, social, linguistic, and visuospatial information, as well as memory, attention, and executive functions. Also discussed are brain development and brain aging, and the nature of intelligence and creativity. "
    },
    "COGS 108": {
        "prerequisites": [
            "CSE 11",
            "or",
            "CSE 8A",
            "or",
            "COGS 18",
            "or",
            "DSC 10",
            "or",
            "MAE 8"
        ],
        "name": "Data Science in Practice",
        "description": "Data science is multidisciplinary, covering computer science, statistics, cognitive science and psychology, data visualization, artificial intelligence and machine learning, among others. This course teaches critical skills needed to pursue a data science career using hands-on programming and experimental challenges. "
    },
    "COGS 109": {
        "prerequisites": [
            "COGS 14B",
            "MATH 18",
            "or",
            "MATH 31AH",
            "and",
            "COGS 18",
            "or",
            "CSE 7",
            "or",
            "CSE 8A",
            "or",
            "CSE 11"
        ],
        "name": "Modeling and Data Analysis",
        "description": "Exposure to the basic computational methods useful throughout cognitive science. Computing basic statistics, modeling learning individuals, evolving populations, communicating agents, and corpus-based linguistics will be considered. "
    },
    "COGS 110": {
        "prerequisites": [
            "COGS 1",
            "or",
            "HDP 1",
            "or",
            "HDS 1"
        ],
        "name": "The Developing Mind",
        "description": "(Cross-listed with HDS 121.)\n                    This course examines changes in thinking and perceiving the\n                    physical and social world from birth through childhood. Evidence\n                    of significant changes in encoding information, forming mental\n                    representations, and solving problems is culled from psychological\n                    research, cross-cultural studies, and cognitive science. Cross-listed course. HDS 121 has been renumbered from HDP 121. Students may receive credit for one of the following: COGS 110, HDS 121, or HDP 121. "
    },
    "COGS 115": {
        "prerequisites": [
            "BILD 10",
            "or",
            "BILD 12",
            "or",
            "COGS 107A",
            "or",
            "COGS 107B",
            "or",
            "COGS 17",
            "or",
            "HDP 110"
        ],
        "name": "Neurological Development and Cognitive Change",
        "description": "This course provides an overview of neurological\n\t\t\t\t  development and explores the relations between physiological\n\t\t\t\t  change and the experience for the child from the prenatal period\n\t\t\t\t  through adolescence. "
    },
    "COGS 118A": {
        "prerequisites": [
            "COGS 18",
            "or",
            "CSE 8B",
            "or",
            "CSE 11",
            "and",
            "MATH 18",
            "or",
            "MATH 31AH",
            "and",
            "MATH 20E",
            "and",
            "MATH 180A",
            "and",
            "COGS 108",
            "or",
            "COGS 109",
            "or",
            "COGS 118B",
            "or",
            "CSE 150",
            "or",
            "CSE 151",
            "or",
            "CSE 158",
            "or",
            "ECE 174",
            "or",
            "ECE 175A"
        ],
        "name": "Supervised Machine Learning Algorithms ",
        "description": "This course introduces the mathematical formulations and algorithmic implementations of the core supervised machine learning methods. Topics in 118A include regression, nearest neighborhood, decision tree, support vector machine, and ensemble classifiers. COGS 118A-B may be taken in either order.   ** Consent of instructor to enroll possible  **"
    },
    "COGS 118B": {
        "prerequisites": [
            "CSE 8B",
            "or",
            "CSE 11",
            "and",
            "MATH 18",
            "or",
            "MATH 31AH",
            "and",
            "MATH 20E",
            "and",
            "MATH 180A"
        ],
        "name": "Introduction to Machine Learning II ",
        "description": "This course, with COGS 118A, forms a rigorous introduction to machine learning. Topics in 118B include maximum likelihood estimation, Bayesian parameter estimation, clustering, principal component analysis, and some application areas. COGS 118A-B may be taken in either order.  ** Consent of instructor to enroll possible  **"
    },
    "COGS 118C": {
        "prerequisites": [
            "MATH 18",
            "or",
            "MATH 31AH",
            "COGS 14B",
            "or",
            "PSYC 60",
            "and",
            "COGS 108",
            "or",
            "COGS 109"
        ],
        "name": "Neural Signal Processing",
        "description": "This course will cover theoretical foundations and practical applications of signal processing to neural data. Topics include EEG/field potential methods (filtering, Fourier (spectral) analysis, coherence) and spike train analysis (reverse correlation, spike sorting, multielectrode recordings). Some applications to neural imaging (optical microscopy, fMRI) data will also be discussed. "
    },
    "COGS 118D": {
        "prerequisites": [
            "MATH 18",
            "or",
            "MATH 31AH",
            "and",
            "MATH 180A"
        ],
        "name": "Mathematical Statistics for Behavioral Data Analysis",
        "description": "Statistical methods for analyzing behavioral data. A mathematically sophisticated course covering both classical and Bayesian statistical methods for estimation, hypothesis testing, regression, and model comparison. Emphasis on both mathematical understanding of statistical methods as well as common applications.  ** Consent of instructor to enroll possible  **"
    },
    "COGS 119": {
        "prerequisites": [
            "COGS 14B",
            "and",
            "MATH 18",
            "or",
            "MATH 31AH",
            "and",
            "MAE 8"
        ],
        "name": "Programming for Experimental Research",
        "description": "This course will help students in the behavioral sciences (cognitive science, psychology, linguistics, neuroscience, and related fields) learn how to program experiments and analyze and present data. "
    },
    "COGS 120": {
        "prerequisites": [
            "CSE 11",
            "or",
            "CSE 8B",
            "or",
            "DSC 30",
            "and",
            "COGS 1",
            "or",
            "COGS 187A",
            "or",
            "DSGN 1"
        ],
        "name": "Interaction Design ",
        "description": "(Cross-listed with CSE 170.) Introduces fundamental methods and principles for designing, implementing, and evaluating user interfaces. Topics: user-centered design, rapid prototyping, experimentation, direct manipulation, cognitive principles, visual design, social software, software tools. Learn by doing: work with a team on a quarter-long design project. Recommended preparation: basic familiarity with HTML. Students may not receive credit for both COGS 120 and CSE 170. "
    },
    "COGS 121": {
        "prerequisites": [
            "COGS 120",
            "and",
            "CSE 8B",
            "or",
            "CSE 11",
            "or",
            "DSC 30"
        ],
        "name": "Human Computer Interaction Programming Studio",
        "description": "This course covers fundamentals of user interface design and implementation of web-based systems. A major component is completion of a substantial programming project in which students work together in small teams. "
    },
    "COGS 122": {
        "prerequisites": [
            "DSGN 100",
            "or",
            "COGS 187B",
            "or",
            "COGS 187A",
            "or",
            "COGS 120",
            "or",
            "CSE 170"
        ],
        "name": "Startup Studio",
        "description": "Explores tools and processes for innovating novel business concepts to solve problems involving the interaction between humans and technology. Students will work with an interdisciplinary team to understand unmet user needs and to create a value proposition that balances technical feasibility, financial viability, and desirability. "
    },
    "COGS 123": {
        "prerequisites": [
            "COGS 102C",
            "or",
            "COGS 120",
            "or",
            "COGS 187A",
            "or",
            "COGS 187B",
            "or",
            "DSGN 1"
        ],
        "name": "Social Computing",
        "description": "This course explores the intersection of social behavior and computational systems. Students will examine a range of organizational, technical, and business challenges related to social computing, and learn how to use tools to analyze, design, and build online communities. "
    },
    "COGS 124": {
        "prerequisites": [
            "COGS 120",
            "and",
            "COGS 121"
        ],
        "name": "HCI Technical Systems Research",
        "description": "In this advanced project-based course, we study the state-of-the-art in research on technical systems for human-computer interaction (HCI). Students will deconstruct the systems described in top-tier HCI papers and work in teams to create novel technical systems of their own. "
    },
    "COGS 125": {
        "prerequisites": [
            "CSE 11",
            "and",
            "COGS 120",
            "or",
            "CSE 170"
        ],
        "name": "Advanced Interaction Design",
        "description": "This is a studio class for students who are passionate about diving deep into interaction design and honing their design skills. Introduces social computing, input and interaction techniques, and information design. Students will regularly present work in a studio format. "
    },
    "COGS 126": {
        "prerequisites": [
            "COGS 120",
            "or",
            "COGS 121",
            "or",
            "CSE 170"
        ],
        "name": "Human-Computer Interaction",
        "description": "This course surveys the field of human-computer interaction and the ideas and technologies that have shaped its development. "
    },
    "COGS 127": {
        "prerequisites": [
            "CSE 11",
            "or",
            "CSE 8B",
            "or",
            "DSC 30",
            "and",
            "COGS 1",
            "or",
            "COGS 187A",
            "or",
            "DSGN 1"
        ],
        "name": "Designing Human-Data Interactions",
        "description": "Introduces human-data interaction design, combining concepts from human-computer interaction (HCI) and data science. Topics: user-centered design, prototyping, exploratory data analysis, interactive data visualization, data storytelling. Work in teams on a quarter-long project. "
    },
    "COGS 143": {
        "prerequisites": [],
        "name": "Animal Cognition",
        "description": "Examines the contrasts and parallels between primates and cetaceans in sensorimotor constraints, neuroanatomy, field behavior, and cognition in the lab, with a focus on the demands of competition and cooperation that helped shape the evolution of social cognition. Students may not receive credit for COGS 143 and COGS 143GS. "
    },
    "COGS 144": {
        "prerequisites": [
            "COGS 14A-B"
        ],
        "name": "Social Cognition: A Developmental and Evolutionary Perspective",
        "description": "This course presents the building blocks of social cognition from a developmental and evolutionary perspective and focuses on how and when children develop these abilities and how humans compare to other species such as great apes, birds, and dogs. "
    },
    "COGS 151": {
        "prerequisites": [],
        "name": "Analogy and Conceptual Systems",
        "description": "Human thought and meaning are deeply tied to the capacity for mapping conceptual domains onto each other, inducing common schemas and performing mental simulation. This course examines major aspects of this cognitive activity including metaphor, conceptual blending, and embodied cognition. "
    },
    "COGS 152": {
        "prerequisites": [
            "COGS 1",
            "or",
            "PHIL 1",
            "or",
            "PSYC 1",
            "or",
            "EDS (20"
        ],
        "name": "Cognitive Foundations of Mathematics",
        "description": "How the human mind/brain creates mathematics: embodiment, innovation, and creativity. The emergence and power of abstract concepts, such as infinity, infinitesimals, imaginary numbers, or zero. Cognitive approaches that connect mathematics to human thought in general. "
    },
    "COGS 153": {
        "prerequisites": [],
        "name": "Language Comprehension",
        "description": "The processes and representations involved in understanding language—processing words, syntax, semantics, and discourse—are examined in light of evidence from both psychological experiments and computer simulations. "
    },
    "COGS 154": {
        "prerequisites": [],
        "name": "Communication Disorders in Children and Adults",
        "description": "Neural bases of language use in normal adults, and neural bases of language and communication development in normal children. Evidence on the language and communication deficits in adults (especially aphasia and dementia) and children (specific language impairment, focal brain injury, retardation, and autism). "
    },
    "COGS 155": {
        "prerequisites": [],
        "name": "Gesture and Cognition",
        "description": "Spontaneous gestures and their relationship\n\t\t\t\t  to speech, cognition, brain, and culture. The course covers, among others,\n\t\t\t\t  gesture and language development, gesture and conceptual systems, speech-gesture\n\t\t\t\t  coproduction and its brain bases, evolution of language, and gestural\n\t\t\t\t  behavior in special populations. "
    },
    "COGS 156": {
        "prerequisites": [],
        "name": "Language Development",
        "description": "A comprehensive survey of theory, method and research findings\n                  on language development in children ranging from the earliest\n                  stages of speech perception and communication at birth to refinements\n                  in narrative discourse and conventional fluency through middle\n                  childhood and adolescence.  ** Upper-division standing required ** "
    },
    "COGS 157": {
        "prerequisites": [
            "COGS 101A",
            "or",
            "COGS 101B",
            "or",
            "COGS 101C"
        ],
        "name": "Music and the Mind",
        "description": "Explores how humans (and other species) process music, including pitch, meter, emotion, motor aspects, links to language, brain activity. Students should have experience reading musical notation. "
    },
    "COGS 160": {
        "prerequisites": [],
        "name": "Upper-Division Seminar on Special Topics",
        "description": "Special topics in cognitive science are discussed. (May be repeated when topics vary.) "
    },
    "COGS 163": {
        "prerequisites": [],
        "name": "Metabolic Disorders of the Brain",
        "description": "Research is showing that cellular metabolic processes are mediating normal and abnormal brain function. For example, neurocognitive disorders often co-occur with metabolic disturbances, such as insulin resistance, diabetes, and obesity. An understanding of these mechanisms will provide insight to new treatments for cognitive and neurological disorders. The course will cover topics on the role of abnormal cellular structure, genetic, epigenetic and pathogenic influences on synaptic signaling. "
    },
    "COGS 164": {
        "prerequisites": [],
        "name": "Neurobiology of Motivation",
        "description": "This course will address principles of motivation, valuation, and reward, spanning a large territory of topics, from rules of synaptic learning to classroom learning. Recommended preparation: courses in basic biology, physiology, COGS 107A or 107B or 107C, or courses in education. "
    },
    "COGS 169": {
        "prerequisites": [
            "COGS 1",
            "and"
        ],
        "name": "Genetic Information for Behavior: From Single Cells to Mammals",
        "description": "Behavior draws on a wide range of genes acting as a complex source of information. Model organisms—bacteria, Paramecium, C. elegans, Drosophila, and mice—have provided insight into how genes influence both innate and learned behaviors. "
    },
    "COGS 170": {
        "prerequisites": [
            "COGS 17",
            "or",
            "BILD 12"
        ],
        "name": "Brain Waves Across Scales",
        "description": "This course will provide an interactive and hands-on introduction to rhythms and large-scale electrical potentials of the brain. Topics will include the resonance properties of neurons, rhythmic interactions between neurons, the coordination of activity across large populations of neurons that is measurable in the local field potential (LFP) and electroencephalogram (EEG), the advantages of temporally coordinated neural activity, and relevant insights about the brain and cognitive disorders. "
    },
    "COGS 171": {
        "prerequisites": [],
        "name": "Mirror Neuron System",
        "description": "This class will examine the neuroanatomy, physiology, and functional correlates of the human mirror neuron system and its putative role in social cognition, e.g., action understanding, empathy, and theory of mind. We will examine the developmental, neuroimaging, electrophysiological, as well as clinical evidence, for and against this hypothesis. "
    },
    "COGS 172": {
        "prerequisites": [
            "COGS 107A"
        ],
        "name": "Brain Disorders and Cognition",
        "description": "A review of the patterns of impaired and intact cognitive abilities present in brain-damaged patients in terms of damage to one or more components of a model of normal cognitive functioning. "
    },
    "COGS 174": {
        "prerequisites": [],
        "name": "Drugs: Brain, Mind, and Culture",
        "description": "This course explores how drugs interact with the brain/mind and culture. It covers evolutionary and historical perspectives, brain chemistry, pharmacology, expectancies and placebo effects, and models of addiction. It also provides a biopsychosocial survey of commonly used and abused substances. "
    },
    "COGS 175": {
        "prerequisites": [
            "COGS 101A",
            "or",
            "COGS 107A"
        ],
        "name": "The Neuropsychological Basis of Alternate States of Consciousness",
        "description": "This course will review the literature that correlates brain rhythms in the human EEG with aspects of cognition, behavioral states, neuropsycho-pharmacology, and psychopathology in order to understand the psychological and neurophysiological underpinnings of these experiences. "
    },
    "COGS 176": {
        "prerequisites": [
            "COGS 107A"
        ],
        "name": "From Sleep to Attention",
        "description": "This course will combine an examination of the neural character of quiet and active sleep states and their potential functions with an examination of the different mechanisms by which the brain mediates attention to specific features of the world. "
    },
    "COGS 177": {
        "prerequisites": [],
        "name": "Space and Time in the Brain",
        "description": "The course examines features of neural dynamics that map spatial and temporal relationships. Lectures will cover interval timing, mapping of item-to-observer position, mapping of observer-to-world position, and the conjunction of spatial and temporal coding in hippocampus. "
    },
    "COGS 178": {
        "prerequisites": [
            "COGS 107A-B"
        ],
        "name": "Genes, Brains, and Behavior",
        "description": "Evidence for genetic mediation of behavioral and neural differences, mechanisms that may mediate these effects, and the roles of the environment and experience are discussed.  ** Consent of instructor to enroll possible  **"
    },
    "COGS 179": {
        "prerequisites": [
            "COGS 107A",
            "or",
            "COGS 17"
        ],
        "name": "Electrophysiology of Cognition",
        "description": "Survey the theory and practice of using electrical\n\t\t\t\t  recordings (event-related brain potentials) to study cognition and behavior\n\t\t\t\t  including attention, language, mental chronometry, memory, and plasticity. "
    },
    "COGS 180": {
        "prerequisites": [
            "BILD 12",
            "or",
            "COGS 107B",
            "or",
            "PSYC 106",
            "and",
            "MATH 31AH",
            "or",
            "MATH 18",
            "and",
            "MATH 20B",
            "and",
            "COGS 108",
            "or",
            "COGS 109",
            "or",
            "COGS 18",
            "or",
            "CSE 8A",
            "or",
            "CSE 11"
        ],
        "name": "Decision Making in the Brain ",
        "description": "This course covers recent advances in the understanding of neural mechanisms and computational principles underlying the brain’s ability to make decisions. The role of various factors, as well as their neural encoding, will be considered, e.g., observation noise, reward, risk, internal uncertainty, emotional state, external incentives. "
    },
    "COGS 181": {
        "prerequisites": [
            "COGS 18",
            "or",
            "CSE 11",
            "or",
            "CSE 8B",
            "and",
            "MATH 18",
            "or",
            "MATH 31AH",
            "and",
            "MATH 20E",
            "and",
            "MATH 180A",
            "and",
            "COGS 118A",
            "or",
            "COGS 118B",
            "or",
            "CSE 150",
            "or",
            "CSE 151",
            "or",
            "CSE 158",
            "or",
            "ECE 174",
            "or",
            "ECE 175A"
        ],
        "name": "Neural Networks and Deep Learning",
        "description": "This course will cover the basics about neural networks, as well as recent developments in deep learning including deep belief nets, convolutional neural networks, recurrent neural networks, long-short term memory, and reinforcement learning. We will study details of the deep learning architectures with a focus on learning end-to-end models for these tasks, particularly image classification. "
    },
    "COGS 184": {
        "prerequisites": [
            "COGS 17",
            "or",
            "COGS 107A",
            "or",
            "COGS 107B",
            "or",
            "COGS 107C",
            "or",
            "BILD 12"
        ],
        "name": "Modeling the Evolution of Cognition",
        "description": "This interdisciplinary course integrates data on evolutionary theory, hominid prehistory, primate behavior, comparative neuroanatomy, cognitive development, and collaboration. After lectures, readings, and discussion of the literature, students generate a detailed timeline of five million years of human cognitive evolution. Students may not receive credit for COGS 184 and COGS 184GS. "
    },
    "COGS 185": {
        "prerequisites": [
            "COGS 118B",
            "or",
            "COGS 118A"
        ],
        "name": "Advanced Machine Learning Methods",
        "description": "This course is an advanced seminar and project course that follows the introduction to machine learning courses. Advanced and new machine learning methods will be discussed and used. "
    },
    "COGS 187A": {
        "prerequisites": [
            "COGS 18",
            "or",
            "CSE 11",
            "or",
            "CSE 8A",
            "and",
            "COGS 10",
            "or",
            "DSGN 1"
        ],
        "name": "Usability and Information Architecture ",
        "description": "Examines the cognitive basis of successful web and multimedia design. Topics: information architecture, navigation, usability, graphic layout, transaction design, and how to understand user interaction. "
    },
    "COGS 187B": {
        "prerequisites": [
            "COGS 187A"
        ],
        "name": "Practicum in Professional Web Design ",
        "description": "This course follows up on the basics of multimedia design taught in COGS 187A. Students will probe more deeply into selective topics, such as animation, navigation, graphical display of information, and narrative coherence.   ** Consent of instructor to enroll possible  **"
    },
    "COGS 188": {
        "prerequisites": [
            "COGS 109",
            "or",
            "COGS 118A",
            "or",
            "COGS 118B"
        ],
        "name": "Artificial Intelligence Algorithms ",
        "description": "This class will cover a broad spectrum of machine learning algorithms. It builds on students’ previous exposure to machine learning. It covers new artificial intelligence algorithms ranging from topic models as used in the text data analysis to genetic algorithms. "
    },
    "COGS 189": {
        "prerequisites": [
            "COGS 108",
            "or",
            "COGS 109",
            "or",
            "COGS 118A",
            "or",
            "COGS 118B"
        ],
        "name": "Brain Computer Interfaces",
        "description": "This course will discuss signal processing, pattern recognition algorithms, and human-computer interaction issues in EEG-based brain-computer interfaces. Other types of brain-computer interfaces will also be discussed. "
    },
    "COGS 190A": {
        "prerequisites": [],
        "name": "Pre-Honors Project in Cognitive Science",
        "description": "This course prepares students for the Cognitive\n\t\t\t\t  Science Honors Program. The aim is to refine the research project and to\n\t\t\t\t  teach students what a successfully written proposal entails. Students may\n\t\t\t\t  be admitted to the Honors Program contingent upon completion and progress\n\t\t\t\t  in the course. See “Cognitive\n\t\t\t\t  Science Honors Program” section for more\n\t\t\t\t  information. Course should be taken for a letter grade. "
    },
    "COGS 190B": {
        "prerequisites": [
            "COGS 190A",
            "and"
        ],
        "name": "Honors Studies in Cognitive Science",
        "description": "This course will allow cognitive science honors\n\t\t\t\t  students to explore advanced issues in the field of cognitive science research.\n\t\t\t\t  It will also provide the opportunity to develop a thesis on the topic of\n\t\t\t\t  their choice and begin work under faculty supervision. See “Cognitive\n\t\t\t\t  Science Honors Program” section for more\n\t\t\t\t  information. "
    },
    "COGS 190C": {
        "prerequisites": [
            "COGS 190B",
            "and"
        ],
        "name": "Honors Thesis in Cognitive Science",
        "description": "This course will provide honors candidates\n\t\t\t\t  an opportunity to complete the research on and preparation\n\t\t\t\t  of an honors thesis under close faculty supervision. Oral presentation\n\t\t\t\t  of student’s\n\t\t\t\t  thesis is required to receive honors; additionally, student\n\t\t\t\t  must receive grade of A– or better in 190B and 190C to receive honors. See “Cognitive\n\t\t\t\t  Science Honors Program” section for more\n\t\t\t\t  information. "
    },
    "COGS 190D": {
        "prerequisites": [],
        "name": "Preparation for Thesis Presentation",
        "description": "This course is affiliated with the honors program (190A-B-C) and is required of honors students during spring quarter. Its aim is to prepare students to present research results to an audience. Emphasis will be on the oral presentation (organization, wording, graphics), but there will also be some discussion about written research reports. Seminar style format with occasional short lectures wherein students will practice oral presentations and provide constructive criticism to each other. "
    },
    "COGS 195": {
        "prerequisites": [],
        "name": "Instructional Apprenticeship in Cognitive Science",
        "description": "Students, under the direction of the instructor, lead laboratory or discussion sections, attend lectures, and meet regularly with the instructor to help prepare course materials and grade papers and exams. Applications must be submitted to and approved by the department. P/NP grades only. May be taken for credit three times. "
    },
    "COGS 197": {
        "prerequisites": [],
        "name": "Cognitive Science Internship",
        "description": "The student will undertake a program of practical research in a supervised work environment. Topics to be researched may vary, but in each case the course will provide skills for carrying out these studies. P/NP grades only. May be taken for credit up to three times. "
    },
    "COGS 198": {
        "prerequisites": [],
        "name": "Directed Group Study",
        "description": "This independent study course is for small groups of advanced students who wish to complete a one-quarter reading or research project under the mentorship of a faculty member. Students should contact faculty whose research interests them to discuss possible projects. P/NP grades only. May be taken for credit three times.  ** Consent of instructor to enroll possible  **"
    },
    "COGS 199": {
        "prerequisites": [],
        "name": "Special Project",
        "description": "This independent study course is for individual, advanced students who wish to complete a one-quarter reading or research project under the mentorship of a faculty member. Students should contact faculty whose research interests them to discuss possible projects. P/NP grades only. May be taken for credit three times.   ** Consent of instructor to enroll possible  **"
    }
}