{
    "EDS 20S": {
        "prerequisites": [],
        "name": "Introduction to Principles of Learning",
        "description": "Students will study discipline-specific principles of effective learning, including critical thinking, problem solving, collaboration, and group communication. Laboratory and hypothesis testing, library research and writing skills, and self-assessment. Students will explore concepts and procedures in mathematics, science, and economics. "
    },
    "EDS 21S": {
        "prerequisites": [],
        "name": "Writing and Learning—Triton Transition",
        "description": "Reading, writing, and speaking exercises will introduce students to the teaching conventions and learning expectations of American universities. Students will use writing as a means of academic inquiry to explore the culture of higher education in the United States and will gain practice with appropriate style, structure, and mechanics. P/NP grades only. "
    },
    "EDS 22": {
        "prerequisites": [],
        "name": "Education in Cuba: Institutional Structures, History, and Culture",
        "description": "Cuba’s educational system achieves higher outcomes than any other country in Latin America, and compared to the United States, it represents a very different institutional structure. Cuban education serves as an explicit vehicle for the transmission of Cuban culture and historical consciousness. This course examines Cuba’s emphasis on educational achievement following the triumph of its revolution in 1959, including institutional structures, pedagogy, and content. "
    },
    "EDS 22S": {
        "prerequisites": [],
        "name": "Education in Cuba—Field Experience",
        "description": "This course provides a combination of seminar work and intensive field experience after the end of the spring quarter, during special summer session. Topics are introduced and analyzed in seminars and reinforced and expanded upon in field visits to historic and cultural sites in Cuba. Additional fees may be required for travel expenses. "
    },
    "EDS 23": {
        "prerequisites": [],
        "name": "Success and Satisfaction in the Second Year of Higher Education: Research Trends and Conclusions",
        "description": "Course focuses on challenges that confront college students in their second year of higher education and solutions. Emphasis on historically underrepresented students of color with more complex adjustment to college. Analysis of national trends from research including High Impact Practices. "
    },
    "EDS 25": {
        "prerequisites": [],
        "name": "American Higher Education and the Collegiate Experience",
        "description": "This course is designed to help students think critically about multicultural issues in higher education, as well as the purpose of higher education within the larger context of society. Topics include American higher education history, organization, policy, curricula, and access."
    },
    "EDS 30/MATH 5": {
        "prerequisites": [],
        "name": "Introduction to Math Teaching",
        "description": "Revisit students’ learning difficulties in mathematics in more depth to prepare students to make meaningful observations of how K–12 teachers deal with these difficulties. Explore how instruction can use students’ knowledge to pose problems that stimulate students’ intellectual curiosity. "
    },
    "EDS 31/CHEM 96": {
        "prerequisites": [],
        "name": "\t\t  Introduction to Teaching Science",
        "description": "Explores routine challenges and exceptional difficulties students often have in learning science. Prepares students to make meaningful observations of how K–12 teachers deal with difficulties. Explores strategies that teachers may use to pose problems that stimulate students’ intellectual curiosity. "
    },
    "EDS 38": {
        "prerequisites": [],
        "name": "Explorations in Education",
        "description": "Undergraduate students are placed in local schools and other educational settings within the community. Students work on educational activities with K–12 students a minimum of twenty hours/quarter. If taken for the EDS major, must be taken for a letter grade. "
    },
    "EDS 39": {
        "prerequisites": [],
        "name": "Explorations in Secondary STEM Education ",
        "description": "Undergraduate students explore current practices and issues in public education focusing on STEM secondary education (grades 6–12) through readings, guest speakers, seminars, and observations in math, science, and computer science classrooms at local schools. "
    },
    "EDS 50": {
        "prerequisites": [],
        "name": "Chancellor’s Associates Scholars Program Freshman Introductory Course",
        "description": "This course facilitates academic success at a leading research university by helping students understand and embrace academic and curricular expectations, engage and map cocurricular opportunities, and strengthen critical thinking, organizational, interpersonal, and wellness skills. "
    },
    "EDS 87": {
        "prerequisites": [],
        "name": "Freshman Seminar in Education Studies",
        "description": "The Freshman Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. Topics vary from quarter to quarter. P/NP grades only. "
    },
    "EDS 102": {
        "prerequisites": [],
        "name": "Introduction to Qualitative Methods in Education Research",
        "description": "Introductory course addressing topics in qualitative research method and analytic approaches, including methods such as case studies, video analysis, interviews, observations, and ethnography. Concepts explore the practice and philosophical underpinnings of specified qualitative research approach and examples of qualitative studies. If taken for EDS major, must be taken for a letter grade. "
    },
    "EDS 103": {
        "prerequisites": [],
        "name": "Introduction to Quantitative Methods in Education Research",
        "description": "Introduction to quantitative fundamentals of statistical inference in education research. Emphasis on applying statistical concepts, selecting appropriate techniques, using techniques, and examining assumptions to interpret analytic results and summarize findings. Hands-on practice will be integral to the course. If taken for EDS major, must be taken for a letter grade. "
    },
    "EDS 105/PHYS 180": {
        "prerequisites": [
            "PHYS 1A",
            "or",
            "PHYS 2A",
            "or",
            "PHYS 4A",
            "and",
            "PHYS 1B",
            "or",
            "PHYS 2B",
            "or",
            "PHYS 4C",
            "and",
            "PHYS 1C",
            "or",
            "PHYS 2C",
            "or",
            "PHYS 2D",
            "or",
            "PHYS 4B"
        ],
        "name": "Teaching and Learning Physics",
        "description": "How people learn and understand key concepts in physics. Readings in physics, physics education research, and cognitive science. Useful for students interested in teaching and learning physical sciences. "
    },
    "EDS 110R": {
        "prerequisites": [],
        "name": "Early Learning Environments for Diverse Learners",
        "description": "In this online course, students examine the diverse contexts in which children develop. They will explore theories of child development and how they intersect with traditional learning theories. From these foundational concepts we will explore how to develop lessons and learning activities to support the needs of diverse learners. "
    },
    "EDS 111": {
        "prerequisites": [],
        "name": "Child, Family, and Community Partnerships with Schools",
        "description": "This course examines how early education programs collaborate with socioculturally diverse families to support child development. Theories will examine social learning, family socialization, risk and resilience, and community engagement and how these theories are enacted in schools, communities, and families. Course assignments will support undergraduates to utilize families’ beliefs, strengths, and resources to support children’s learning with opportunities to engage with them. "
    },
    "EDS 112": {
        "prerequisites": [],
        "name": "Urban Education in the United States",
        "description": "Students will read, discuss, and analyze past and present urban education demographics, resources, policies, practices, and outcomes to deepen their knowledge and critique of issues in urban education. "
    },
    "EDS 113": {
        "prerequisites": [],
        "name": "Chicanas/os and Latinos in Education: Policy, Practice, and Challenges to Equity",
        "description": "An overview of the experiences, challenges, and opportunities for educating Chicano/Latino students. This course unpacks the socioeconomic and systematic factors that underlie these data. Further, to understand this persistent phenomenon and explore approaches to altering the current pathway of this group, this course will provide a comprehensive overview of Chicana/o-Latina/o students at every state in the P–20 education continuum. "
    },
    "EDS 114": {
        "prerequisites": [],
        "name": "Cognitive Development and Interactive Computing Environments",
        "description": "Development and learning are increasingly supported by interactive computing environments. This course will explore technology-supported learning environments, looking at the ways they can be used to promote effective development, learning, and teaching. "
    },
    "EDS 115": {
        "prerequisites": [],
        "name": "Cognitive Development and Education",
        "description": "This course examines the development of cognition, thinking, and language from infancy to adolescence with implications for education. Topics include learning theories, executive function, memory and language, as well as impacts of technology, poverty, diversity, and bilingualism. Course content focuses on addressing achievement gaps. Students may not receive credit for both EDS 115 and EDS 115GS. "
    },
    "EDS 115GS": {
        "prerequisites": [],
        "name": "Cognitive Development and Education",
        "description": "This course examines the development of cognition, thinking, and language from infancy to adolescence with implications for education. Topics include learning theories, executive function, memory and language, as well as impacts of technology, poverty, diversity, and bilingualism. Course content focuses on addressing achievement gaps. This course is offered in Quito, Ecuador. It will integrate field experiences gained through organized class excursions and individual experiences of students. Program or materials fees may apply. Students may not receive credit for both EDS 115GS and EDS 115. "
    },
    "EDS 116": {
        "prerequisites": [],
        "name": "Equity-Minded Education ",
        "description": "This course introduces the foundational historical and theoretical issues for the critical study of higher education diversity work and student affairs. This course integrates questions of identity with those of social justice and requires a strong commitment to understanding self and other. The role of mentoring, advising, and counseling will also be examined. "
    },
    "EDS 117": {
        "prerequisites": [],
        "name": "Language, Culture, and Education",
        "description": "(Same as SOCI 117) The mutual influence of language, culture, and education will be explored; explanations of students’ school successes and failures that employ linguistic and cultural variables will be considered; bilingualism and cultural transmission through education. Students may not receive credit for EDS 117 and SOCI 117 and EDS 117GS. "
    },
    "EDS 117GS": {
        "prerequisites": [],
        "name": "Language, Culture, and Education",
        "description": "The mutual influence of language, culture, and education will be explored; explanations of students’ school successes and failures that employ linguistic and cultural variables will be considered; bilingualism and cultural transmission through education. This course is offered in Quito, Ecuador. It will integrate field experiences gained through organized class excursions and individual experiences of students. Program or materials fees may apply. Students may not receive credit for EDS 117GS and EDS 117 and SOCI 117. "
    },
    "EDS 118": {
        "prerequisites": [],
        "name": "Adolescent Development and Education",
        "description": "This course introduces prospective secondary teachers to the cognitive, social, and emotional development of adolescents, including developmental learning theory, the teaching/learning process, effective learning environments, and cross-cultural variation in development. Implications for classroom practice are drawn. "
    },
    "EDS/LIGN 119": {
        "prerequisites": [],
        "name": "First and Second Language Learning: From Childhood through Adolescence",
        "description": "An examination of how human language learning ability develops and changes over the first two decades of life, including discussion of factors that may affect this ability. "
    },
    "EDS 120": {
        "prerequisites": [
            "EDS 126",
            "or",
            "EDS 136",
            "or",
            "USP 129",
            "POLI 108",
            "or",
            "POLI 100Q",
            "or",
            "POLI 100O",
            "or",
            "POLI 100H",
            "ETHN 3",
            "or",
            "ETHN 2",
            "or",
            "ANTH 131",
            "or",
            "ANTH 21",
            "or",
            "ANTH 23",
            "or",
            "DOC 1",
            "or",
            "DOC 100D",
            "or",
            "EDS 112",
            "or",
            "EDS 113",
            "or",
            "EDS 117",
            "EDS 125"
        ],
        "name": "Introduction to Design-Based Educational Research: A Field Experience for Improving San Diego Schools",
        "description": "The course engages students in field research aimed at supporting education reform efforts in local schools. Students are introduced to a design-based, applied orientation to educational research on equity and diversity. In collaboration with local school leaders, students conduct qualitative research projects on a range of issues that impact youth in schools. Students will examine research on educational equity, theories of education reform, and qualitative research principles and methods. Students are required to travel to school sites. "
    },
    "EDS 121A/MATH 121A": {
        "prerequisites": [
            "EDS 30/MATH",
            "and"
        ],
        "name": "Foundations of Teaching and Learning Mathematics I",
        "description": "Develop teachers’ knowledge base (knowledge of mathematics content, pedagogy, and student learning) in the context of advanced mathematics. This course builds on the previous courses where these components of knowledge were addressed exclusively in the context of high-school mathematics. "
    },
    "EDS 121B/MATH\n\t\t  121B": {
        "prerequisites": [
            "EDS 121A/MATH"
        ],
        "name": "Foundations of Teaching and Learning Math II",
        "description": "Examine how learning theories can consolidate observations about conceptual development with the individual student as well as the development of knowledge in the history of mathematics. Examine how teaching theories explain the effect of teaching approaches addressed in the previous courses. "
    },
    "EDS 122/CHEM 187": {
        "prerequisites": [
            "EDS 31/CHEM"
        ],
        "name": "\t\t  Foundations of Teaching and Learning Science",
        "description": "Examine theories of learning and how they are important in the science classroom. Conceptual development in the individual student, as well as the development of knowledge in the history of science. Key conceptual obstacles in science will be explored. "
    },
    "EDS 123/CHEM 188": {
        "prerequisites": [
            "EDS 122/CHEM"
        ],
        "name": "Capstone Seminar in Science Education",
        "description": "In the lecture and observation format, students\n\t\t\t\t  continue to explore the theories of learning in the science\n\t\t\t\t  classroom. Conceptual development is fostered, as well as continued\n\t\t\t\t  development of knowledge of science history. Students are exposed\n\t\t\t\t  to the science of teaching science in actual practice. "
    },
    "EDS 124A": {
        "prerequisites": [],
        "name": "Teaching Computation in the Digital World",
        "description": "Develop educators’ knowledge base around aspects of the Digital World (e.g., digital devices, systems, networks; data and analysis) and their impacts (social, ethical, legal issues) and contributions to society. Projects introduce novice programming framework(s) and/or other online interfaces to explore and model issues. Prior programming experience is not required. Students may not receive credit for EDS 124A and EDS 124AR. "
    },
    "EDS 124AR": {
        "prerequisites": [],
        "name": "Teaching Computation in the Digital World",
        "description": "This online course develops educators’ knowledge base around aspects of the Digital World (e.g., digital devices, systems, networks; data and analysis) and their impacts (social, ethical, legal issues) and contributions to society. Projects introduce novice programming framework(s) and/or other online interfaces to explore and model issues. Prior programming experience is not required. Students may not receive credit for EDS 124AR and EDS 124A. "
    },
    "EDS 124BR": {
        "prerequisites": [],
        "name": "Teaching Computational Thinking for Everyone",
        "description": "Examine issues in computing education (e.g., access and equity). Conceptual and skill development with core programming concepts (flow of control, abstraction, algorithms) using a novice programming framework. Computer science teaching and assessment methods for deep understanding. "
    },
    "EDS 125": {
        "prerequisites": [],
        "name": "History, Politics, and Theory of Bilingual Education",
        "description": "This course provides a historical overview and models of bilingual education in the United States. Students will examine socio-cultural, theoretical, and policy issues associated with native language and second-language instruction, and legal requirements for public bilingual program. "
    },
    "EDS 126": {
        "prerequisites": [],
        "name": "Social Organization of Education",
        "description": "(Same as SOCI 126) The social organization of education in the United States and other societies; the functions of education for individuals and society; the structure of schools; educational decision making; educational testing; socialization and education; formal and informal education; cultural transmission. "
    },
    "EDS 128 A-B": {
        "prerequisites": [],
        "name": "Introduction to Teaching and Learning",
        "description": "This course series is for undergraduates who are exploring a career in elementary school teaching. Topics addressed include theories of teaching and learning; research on cognition and motivation; and the cultural context of classroom teaching and learning. EDS 128A focuses on the learner in the teaching-learning interaction and EDS 128B focuses on the teacher in the teaching-learning interaction. "
    },
    "EDS 129 A-B-C": {
        "prerequisites": [],
        "name": "Introduction to Teaching and Learning",
        "description": "This course series is for undergraduates who are exploring a career in teaching secondary school. Topics addressed include theories of teaching and learning processes and motivation for science, mathematics, and English instruction. EDS 129A focuses on the analysis of the needs of individual learners and small group instruction techniques; EDS 129B emphasizes the various roles of the classroom teacher and planning individual lessons; and EDS 129C emphasizes the assessment of student work and longer-range curriculum planning. "
    },
    "EDS 130": {
        "prerequisites": [],
        "name": "Introduction to Academic Mentoring of Elementary/School Students",
        "description": "This course focuses on the role of undergraduate mentors in raising academic expectations for students and families traditionally underrepresented at the university. The relationship between the school and community, the social and political organization of elementary schools, and the academic achievement of elementary children are examined. "
    },
    "EDS 131": {
        "prerequisites": [],
        "name": "Early Childhood Development and Education ",
        "description": "This course investigates early child development (birth through eight years) and education and the role of high-quality early education on reducing inequities among diverse populations. Field experience and seminar focus on applying research and theory to experiences in early childhood classrooms (P–3). "
    },
    "EDS 132": {
        "prerequisites": [],
        "name": "Hands-On Seminar",
        "description": "The “Hands-On Lab” enables UC San Diego students to practice inquiry-based instructional strategies with elementary or high school students in authentic laboratory situations supervised be EDS faculty members. The hands-on lessons provide early teaching experience in science for undergraduates exploring teaching as a career. All lessons are based on the California content standards in science. Recommended preparation: knowledge of STEM field subject matter.  "
    },
    "EDS 133": {
        "prerequisites": [],
        "name": "Counseling, Mentoring, and Academic Advising",
        "description": "This course introduces students to foundations of academic advising and counseling. Through a combination of course readings, assignments, lectures, guest speakers, and field experiences, students learn about a social justice approach to academic advising and counseling. The course addresses issues of diversity, equity, access, and inclusion in P–12 schools. The role of language and culture, as well as family and community factors are addressed. "
    },
    "EDS 135": {
        "prerequisites": [],
        "name": "Working with Newcomer Communities in San Diego",
        "description": "This Partners at Learning (PAL) practicum course examines the history, policies, and practices that inform work with newcomers (recent refugees and immigrants) in the San Diego community. Students enrolled in the course will learn about the diverse groups of newcomers in San Diego and will complete their field hours in a variety of school and community settings. "
    },
    "EDS 136": {
        "prerequisites": [],
        "name": "Introduction to Academic Tutoring of Secondary School Students",
        "description": "This course focuses on the role of undergraduate tutors in building academic resiliency in secondary students traditionally underrepresented at the university. The relationship between the school and community, the social and political organization of secondary schools, the philosophical, sociological, and political issues which relate to the US secondary educational system, and the academic achievement of secondary children are examined. "
    },
    "EDS 137": {
        "prerequisites": [],
        "name": "Introduction\n\t\t\t\t  to Discipline-Specific Teaching and Learning",
        "description": "This course examines effective practices for teaching and learning in specific academic content areas in PreK–12 school or community settings. The field experience and seminar focus on relationship building between mentors and learners, discipline-relevant teaching and learning processes, and community service. "
    },
    "EDS 138": {
        "prerequisites": [],
        "name": "Introduction\n\t\t\t\t  to Academic Tutoring at Charter Schools",
        "description": "This course focuses on effects of the Charter School movement on public education in the United States, the role of the research universities in K–12 education, the social and political organization of the schools, the philosophical, sociological, and political issues which relate to the US secondary educational system, and the academic achievement of secondary children. Students investigate the role of undergraduate tutors in building academic resiliency in secondary students traditionally underrepresented at the university. "
    },
    "EDS 139": {
        "prerequisites": [],
        "name": "Practicum in Teaching and Learning",
        "description": "Students are placed in local P–12 schools and community field sites to actively engage in face-to-face educational service work. Students spend a minimum of four hours per week consistently over the ten-week quarter for a minimum total of forty hours per quarter. P/NP grades only. May be taken for credit up to twelve times. Corequisites: One of the following courses must be taken concurrently: EDS 128A-B, or 129A-B-C, 130, 131, 133, 136, 137, 140, or 141. "
    },
    "EDS 140": {
        "prerequisites": [
            "EDS 138",
            "or",
            "EDS 137",
            "or",
            "EDS 136",
            "or",
            "EDS 134",
            "or",
            "EDS 131",
            "or",
            "EDS 130"
        ],
        "name": "Introduction to Action Research in Pre-K–12 Education ",
        "description": "EDS 140 builds on the students’ foundational knowledge about pre-K–12 public education obtained in introductory PAL courses. This course is conducted as a seminar, where students shape their research questions, theoretical frameworks, and data collection methods for the action research projects. In conjunction to their action research projects, EDS 140 students serve as mentors, tutors, and/or interns at local low-income, underserved pre-K–12 public schools and/or community centers. If students wish to continue their service-learning practicum at their host school, they can take EDS 139. "
    },
    "EDS 141": {
        "prerequisites": [
            "EDS 138",
            "or",
            "EDS 137",
            "or",
            "EDS 136",
            "or",
            "EDS 134",
            "or",
            "EDS 131",
            "or",
            "EDS 130"
        ],
        "name": "Action Research in Pre-K–12 Education: Advanced Practicum in Pre-K–12 Schools and Communities",
        "description": "Course builds on students’ prior knowledge, experiences, and work from PAL foundations and intermediate courses to prepare them to conduct action research on relevant P–12 education issues. Students in the course will continue serving as tutors/mentors/interns in schools and communities. Students will also learn how to design educational research, carry out research in ethical ways, and analyze data for themes that the schools and communities find important. "
    },
    "EDS 150": {
        "prerequisites": [],
        "name": "Chancellor’s Associates Scholars Program Transfer Introductory Course",
        "description": "This course facilitates academic success at a leading research university by helping students understand and embrace academic and curricular expectations, engage and map cocurricular opportunities, and strengthen critical thinking, organizational, interpersonal, and wellness skills. P/NP grades only. "
    },
    "EDS 180": {
        "prerequisites": [],
        "name": "Topics in Education Studies",
        "description": "This course examines special topics in P–12 education from a variety of theoretical and pedagogical perspectives. Topics will address pertinent and current issues related to P–12 \n          teaching and learning, with an emphasis on transforming education in a diverse society.\n          May be taken for credit up to four times. "
    },
    "EDS 190": {
        "prerequisites": [],
        "name": "Research Practicum",
        "description": "Supervised research studies with individual topics selected according to students’ special interests. Students will develop a research proposal and begin to gather and analyze data. "
    },
    "EDS 195": {
        "prerequisites": [],
        "name": "Apprentice Teaching",
        "description": "Advanced EDS students are prepared in effective methods of supervising the preparation of UC San Diego students serving as paraprofessionals in K–12 classrooms. Topics covered include classroom management, interpersonal relations, supervision techniques, multicultural and multilingual education, politics in the school, and curriculum development. Each student serves as a discussion leader and conducts at least two workshops. "
    },
    "EDS 198": {
        "prerequisites": [],
        "name": "Directed Group Study",
        "description": "Directed group study, guided reading, and study involving research and analysis of activities and services in multicultural education, bilingual education, the teaching-learning process, and other areas that are not covered by the present curriculum. "
    },
    "EDS 199": {
        "prerequisites": [],
        "name": "Special Studies",
        "description": "Individual guided reading and study involving research and analysis of activities and services in multicultural education, bilingual education, the teaching-learning process, and other areas that are not covered by the present curriculum. "
    }
}