{
    "FMPH 40": {
        "prerequisites": [],
        "name": "Introduction to Public Health",
        "description": "This course provides an introduction to the infrastructure of public health; the analytical tools employed by public health practitioners; bio-psychosocial perspectives of public health problems; health promotion/disease prevention; quality assessment in public health; and legal and ethical concerns. Must be taken for a letter grade to be applied to the public health major. Renumbered from FPMU 40. Students may not receive credit for FPMU 40 and FMPH 40. "
    },
    "FMPH 50": {
        "prerequisites": [],
        "name": "Primary Care and Public Health",
        "description": "This course explores historical and current interactions, achievements, and challenges of primary care and public health. It will analyze the impact of common medical conditions such as obesity, diabetes, mental health disorders, and others on individuals, their families, and society. Must be taken for a letter grade to be applied to the public health major. Renumbered from FPMU 50. Students may not receive credit for FPMU 50 and FMPH 50. "
    },
    "FMPH 101": {
        "prerequisites": [
            "FMPH 40"
        ],
        "name": "Epidemiology ",
        "description": "This course covers the basic principles of epidemiology, with applications to investigations of noninfectious (“chronic”) and infectious diseases. Explores various study designs appropriate for disease surveillance and studies of etiology and prevention. Must be taken for a letter grade to be applied to the public health major. Renumbered from FPMU 101. Students may not receive credit for FMPH 101 and either FPMU 101 or FPMU 101A. "
    },
    "FMPH 102": {
        "prerequisites": [
            "FMPH 40"
        ],
        "name": "Biostatistics in Public Health ",
        "description": "Fundamentals of biostatistics and basic methods for analysis of continuous and binary outcomes for one, two, or several groups. Includes: summarizing and displaying data; probability; statistical distributions; central limit theorem, confidence intervals, hypothesis testing; comparing means of continuous variables between two groups; comparing proportions between two groups; simple and multiple linear regression. Hands-on data analysis using software and statistical applications in public health. Must be taken for a letter grade to be applied to the public health major. Renumbered from FPMU 102. Students may not receive credit for FMPH 102 and either FPMU 101B or FPMU 102. "
    },
    "FMPH 110": {
        "prerequisites": [
            "FMPH 40",
            "and"
        ],
        "name": "Health Behavior and Chronic Diseases",
        "description": "This course introduces health behavior concepts through applications to chronic disease prevention. The focus is on smoking, dietary behaviors, and physical activity and is organized around relationships to health, measurement, influencing factors, interventions, and translation to public health practice. Must be taken for a letter grade to be applied to the public health major. Renumbered from FPMU 110. Students may not receive credit for FPMU 110 and FMPH 110. "
    },
    "FMPH 120": {
        "prerequisites": [
            "FMPH 40",
            "and"
        ],
        "name": "Health Policies for Healthy Lifestyles",
        "description": "This course covers the rationale for and effectiveness of policies to influence nutrition, physical activity, and substance use behavior. Policies include legalization, taxation, labeling, produce manufacturing, warning labels, licensing, marketing, and counter-marketing practices and restrictions on use. Must be taken for a letter grade to be applied to the public health major. Renumbered from FPMU 120. Students may not receive credit for FPMU 120 and FMPH 120. "
    },
    "FMPH 130": {
        "prerequisites": [
            "FMPH 50",
            "FMPH 101",
            "and"
        ],
        "name": "Environmental and Occupational Health",
        "description": "This core public health course addresses the fundamentals of environmental and occupational health, including identification of hazards, basic toxicology, risk assessment, prevention/protection, and regulatory/control policies. Specific environmental and occupational hazards and relevant case studies will be presented. Must be taken for a letter grade to be applied to the public health major. Renumbered from FPMU 130. Students may not receive credit for FPMU 130 and FMPH 130. "
    },
    "FMPH 180A": {
        "prerequisites": [
            "FMPH 40",
            "FMPH 50",
            "FMPH 101",
            "or",
            "FMPH 102",
            "and",
            "FMPH 110"
        ],
        "name": "Public Health Advanced Practicum I",
        "description": "Emphasizes key public health concepts including program planning, research design, and written/oral communication skills. Practicum done in combination with research, internship, or overseas experiences, completed after FMPH 180A. Open to public health majors with upper-division standing.Must be taken for a letter grade to be applied to the public health major. Renumbered from FPMU 180A. Students may not receive credit for FPMU 180A and FMPH 180A.  ** Department approval required ** "
    },
    "FMPH 180B": {
        "prerequisites": [],
        "name": "Public Health Advanced Practicum II",
        "description": "Practicum participants will engage in an experiential learning program at a pre-approved practicum site. Students will participate in applied public health research and/or programs under supervision of UC San Diego faculty. Must be taken for a letter grade to be applied to the public health major. Renumbered from FPMU 180B. Students may not receive credit for FPMU 180B and FMPH 180B.  ** Department approval required ** "
    },
    "FMPH 180C": {
        "prerequisites": [
            "FMPH 180B"
        ],
        "name": "Public Health Advanced Practicum III",
        "description": "Practicum participants will interpret and contextualize findings from the experiential learning program planned in 180A and completed during 180B. Oral and written presentations will focus on disseminating public health information in diverse formats. Must be taken for a letter grade to be applied to the public health major. Renumbered from FPMU 180C. Students may not receive credit for FPMU 180C and FMPH 180C.  ** Department approval required ** "
    },
    "FMPH 191": {
        "prerequisites": [
            "FMPH 40"
        ],
        "name": "Topics in Public Health",
        "description": "Selected topics in the field of public health. Must be taken for a letter grade to be applied to the public health major. May be taken for credit up to three times.  ** Department approval required ** "
    },
    "FMPH 193": {
        "prerequisites": [
            "FMPH 40",
            "FMPH 50",
            "FMPH 101",
            "FMPH 102",
            "and",
            "FMPH 110"
        ],
        "name": "Public Capstone I",
        "description": "This is the first of a two-part capstone series that serves as the culminating experience for the BS in public health (BSPH) majors. Students will integrate the skills and knowledge gained throughout the BSPH program and learn critical elements of public health research and practice.Must be taken for a letter grade to be applied to the public health major.  ** Department approval required ** "
    },
    "FMPH 194": {
        "prerequisites": [
            "FMPH 40",
            "FMPH 50",
            "FMPH 101",
            "FMPH 102",
            "FMPH 110",
            "FMPH 120",
            "and",
            "FMPH 193"
        ],
        "name": "Public Capstone II",
        "description": "This is the second of a two-part capstone series that serves as the culminating experience for the BS in public health (BSPH) majors. Students will interpret and contextualize findings from their projects completed in the first part of the series. Oral and written presentations will focus on disseminating public health information in diverse formats.Must be taken for a letter grade to be applied to the public health major.  ** Department approval required ** "
    },
    "FMPH 195": {
        "prerequisites": [],
        "name": "Instruction in Public Health",
        "description": "Introduction to teaching in a public health course. As an undergraduate instructional apprentice, students will attend the lectures of the course, weekly meetings with students of the course, and weekly meetings with the course instructor. Responsibilities may include class presentations, designing and leading weekly discussion sections, assisting with homework and exam grading, and monitoring and responding to online discussion posts. Renumbered from FPMU 195. FMPH 195 and/or FPMU 195 may be taken for credit for a combined total of two times. "
    },
    "FMPH 196A": {
        "prerequisites": [
            "FMPH 40",
            "FMPH 50",
            "FMPH 101",
            "or",
            "FMPH 102",
            "and",
            "FMPH 110"
        ],
        "name": "Public Health Honors Practicum I",
        "description": "This is the first of a three-part honors series that serves as the culminating experience for the BS in public health (BSPH) majors. Students review, reinforce, and complement skills and knowledge gained throughout the BSPH program, and prepare a proposal integrating critical elements of public health research and practice.Must be taken for a letter grade to be applied to the public health major.  ** Department approval required ** "
    },
    "FMPH 196B": {
        "prerequisites": [
            "FMPH 196A"
        ],
        "name": "Public Health Honors Practicum II",
        "description": "This is the second of a three-part honors series that serves as the culminating experience for the BS in public health majors. This course represents an experiential learning opportunity at a pre-approved community site. Under supervision of public health faculty and pertinent site representatives, students will refine and implement the public health proposal developed in the first part of the honors series. Must be taken for a letter grade to be applied to the public health major.  ** Department approval required ** "
    },
    "FMPH 196C": {
        "prerequisites": [
            "FMPH 196B"
        ],
        "name": "Public Health Honors Practicum III",
        "description": "This is the third of a three-part honors series that serves as the culminating experience for the BS in public health majors. Students will analyze, interpret, and contextualize findings from their projects completed in the series. Oral and written communication will focus on disseminating public health information in diverse formats, and will include a presentation and an honors thesis. Must be taken for a letter grade to be applied to the public health major. "
    },
    "FMPH 199": {
        "prerequisites": [],
        "name": "Independent Study",
        "description": "Individual undergraduate study or research not covered by the present course offerings. Study or research must be under the direction of a faculty member in the Department of Family Medicine and Public Health and approval must be secured from the faculty member prior to registering. P/NP grades only. Renumbered from FPMU 199. FMPH 199 and/or FPMU 199 may be taken for credit a combined total of six times.  ** Consent of instructor to enroll possible  ** ** Department approval required ** "
    }
}