{
    "HIAF 199": {
        "prerequisites": [],
        "name": "Independent Study in African History",
        "description": "Directed readings for undergraduates. "
    },
    "HIEA 122": {
        "prerequisites": [],
        "name": "Late\n\t\t  Imperial Chinese Culture and Society",
        "description": "We read primary and secondary sources to study aspects of culture, society, religions, economy, government, family, gender, class, and individual lives from the tenth through the eighteenth centuries, Song through Qing. Recommended preparation: previous course work on China helpful but not required. May be taken for credit four times with department approval. "
    },
    "HIEA 163/263": {
        "prerequisites": [],
        "name": "Cinema and Society in Twentieth-Century China",
        "description": "This colloquium will explore the relationship between cinema and society in twentieth-century China. The emphasis will be on the social, political, and cultural impact of filmmaking. The specific period under examination (1930s, 1940s, post-1949) may vary each quarter. Graduate students will be expected to submit an additional paper. "
    },
    "HIEA\n\t\t  164/264": {
        "prerequisites": [],
        "name": "Seminar in Late Imperial Chinese History",
        "description": "We read primary and accessible historical scholarship (including fiction) on state, society, religion, culture, and individual lives in Song through Qing times. May be taken for credit three times. May be coscheduled with HIEA 264. "
    },
    "HIEA 166/266": {
        "prerequisites": [],
        "name": "Creating Ming Histories",
        "description": "Ming was considered absolutist, closed, and stagnant. Nowadays its vibrant economy and culture are celebrated. We pair scholarship with primary sources to explore Ming’s complexities and learn how historians work. May be coscheduled with HIEA 266. "
    },
    "HIEA 168/268": {
        "prerequisites": [],
        "name": "Topics in Classical and Medieval Chinese History",
        "description": "Chinese society, thought, religion, culture, economy and politics from the Shang through the Song dynasties, through primary and secondary sources. Topics vary; may be repeated for credit. Requirements differ for undergraduate, MA and PhD students. Graduate students will be required to submit a more substantial piece of work or an additional paper. "
    },
    "HIEA\n\t\t  171/271": {
        "prerequisites": [],
        "name": "Society and Culture in Premodern China",
        "description": "Explores premodern Chinese society and culture through the reading and discussion of classics and masterpieces in history. Examines how values and ideas were represented in the texts and how they differed, developed, or shifted over time. Requirements will vary for undergraduate, MA, and PhD students. Graduate students are required to submit an additional paper. "
    },
    "HIEA 180": {
        "prerequisites": [],
        "name": "Topics in Modern Korean History",
        "description": "This colloquium will examine selected topics in modern Korean\n                  history through both primary sources (in translation) and secondary\n                  sources. Topics will vary year to year. "
    },
    "HIEA 199": {
        "prerequisites": [],
        "name": "Independent\n\t\t  Study in East Asian History",
        "description": "Directed reading for undergraduates under the supervision of various faculty members. "
    },
    "HIEU 160": {
        "prerequisites": [],
        "name": "Topics in Ancient Greek History",
        "description": "Selected topics in ancient Greek history. May be taken for credit three times. "
    },
    "HIEU 161/261": {
        "prerequisites": [],
        "name": "Topics in Roman History",
        "description": "Selected topics in Roman history. May be taken for credit three times as topics will vary. "
    },
    "HIEU 162/262": {
        "prerequisites": [],
        "name": "Topics in Byzantine History",
        "description": "Selected topics in Byzantine history. May be taken for credit three times as topics vary. "
    },
    "HIEU 163/263": {
        "prerequisites": [],
        "name": "Special Topics in Medieval History",
        "description": "Intensive study of special problems or periods in the history of medieval Europe. Topics vary from year to year, and students may therefore repeat the course for credit. "
    },
    "HIEU\n\t\t  171/271": {
        "prerequisites": [],
        "name": "Special Topics in Twentieth-Century Europe",
        "description": "This course alternates with HIEU 170. Topics will vary from year to year. "
    },
    "HIEU 172/272": {
        "prerequisites": [],
        "name": "Comparative European Fascism",
        "description": "This course will be a comparative and thematic examination of the fascist movement and regimes in Europe from the 1920s to the 1940s. In particular, it will focus on the emergence of the two major fascist movements in Italy and Germany. Graduate students will be required to submit a more substantial piece of work with in-depth analysis and with an increased number of sources cited. A typical undergraduate paper would be ten pages, whereas a typical graduate paper would require engagement with primary sources, more extensive reading of secondary material, and be about twenty pages. "
    },
    "HIEU\n\t\t  174/274": {
        "prerequisites": [],
        "name": "The Holocaust: A Psychological Approach",
        "description": "An examination of how traditional moral concerns and human compassion came to be abandoned and how the mass murder of the Jews was organized and carried out. The focus of this course will be on the perpetrators. Requirements will vary for undergraduate MA and PhD students. Graduate students are required to submit a more substantial piece of work. "
    },
    "HIEU 176/276": {
        "prerequisites": [],
        "name": "Politics in the Jewish Past",
        "description": "This seminar addresses Jewish civic autonomy in the late medieval era, the terms of emancipation in the European states, the politics of Jewish socialists, the costs of assimilation, and the consequences of a successful Zionist state in 1948. Graduate students will be required to submit a more substantial piece of work with in-depth analysis and with an increased number of sources cited. A typical undergraduate paper would be ten pages, whereas a typical graduate paper would require engagement with primary sources, more extensive reading of secondary material, and be about twenty pages. "
    },
    "HIEU 178/278": {
        "prerequisites": [],
        "name": "Soviet History",
        "description": "Topics will vary from year to year. Graduate\n\t\t\t\t  students are required to submit a more substantial paper. "
    },
    "HIEU\n\t\t\t\t  181/281": {
        "prerequisites": [],
        "name": "Immigration, Ethnicity, and Identity in Contemporary European\n\t\t  Society",
        "description": "Comparative study of immigration and migration in Europe since 1945. Topics include (im)migrant adaptation, assimilation, and identity; labor systems, opposition to and regulation of migration; competing concepts of nationality and citizenship, conflicts over Muslim immigration; and implications for European integration. Students may not receive credit for both HIEU 181/281 and ERC 101. Graduate students will be expected to submit an additional paper. "
    },
    "HIEU 182/282": {
        "prerequisites": [],
        "name": "The Muslim Experience in Contemporary European Society",
        "description": "Comparative study of Islam in Europe since 1945. Topics include indigenous populations; immigration; Islamic law/church-state questions; EU expansion/integration; gender issues; terrorism; Islamophobia; “Europeanizing” Islam; the historical tradition of European-Muslim encounter and its present political/cultural issues. Graduate students will be required to do an additional paper. "
    },
    "HIEU\n\t\t  183/283": {
        "prerequisites": [],
        "name": "Social History and Anthropology of the Mediterranean",
        "description": "This seminar examines the social history and anthropology of the Mediterranean. Topics covered are the Mediterranean debate, rural economy, peasant society, gender relations, honor and shame, rural violence, class formation, and emigration. The seminar introduces the methodology of historical anthropology. Graduate students will be expected to complete an additional paper or project. "
    },
    "HIEU\n\t\t  184/284": {
        "prerequisites": [],
        "name": "Yugoslavia: Before, During, and After",
        "description": "Examines the multiethnic Yugoslav states that existed from 1918 until the 1990s. Topics include interethnic relations, foreign affairs, Tito’s revisionist communism, the consumerist Yugoslav Dream, culture and society, the violent break-up of the 1990s, and the post-Yugoslav order. Graduate students will be required to submit an additional paper. "
    },
    "HIEU 198": {
        "prerequisites": [],
        "name": "Directed Group Study",
        "description": "Directed group study on European history under the supervision of a member of the faculty on a topic not generally included in the regular curriculum. Students must make arrangements with individual faculty members. "
    },
    "HIEU 199": {
        "prerequisites": [],
        "name": "Independent Study in European History",
        "description": "Directed readings for undergraduates under the supervision of various faculty members. "
    },
    "HILA 145": {
        "prerequisites": [],
        "name": "People and Nature in Amazonia: An Unwritten History",
        "description": "Topics will vary from year to year or quarter to quarter. May be repeated for an infinite number of times due to the nature of the content of the course always changing. "
    },
    "HILA 161/261": {
        "prerequisites": [],
        "name": "History of Women in Latin America",
        "description": "The course surveys Chile’s basic developments beginning with the era of nitrate exports. Students will have the opportunity to address a specific issue of his/her own choosing and develop the topic for class presentation and a final paper. Graduate students are expected to submit a more substantial piece of work. "
    },
    "HILA\n\t\t  162/262": {
        "prerequisites": [],
        "name": "Special Topics in Latin American History",
        "description": "Inside or outside the household, women have always worked. Where do we find Latin American women? How has the labor market changed? How was and is women’s work perceived? What were the consequences of changing work patterns on family life? "
    },
    "HILA 163/263": {
        "prerequisites": [],
        "name": "The History of Chile 1880–Present",
        "description": "Introduction to the historiography on Latin America for the colonial period from Spanish and Portuguese conquests to the Wars of Independence. Requirements will vary for undergraduate, MA, and PhD students. Graduate students are required to submit an additional research paper. "
    },
    "HILA 164/264": {
        "prerequisites": [],
        "name": "Women’s Work and Family Life in Latin America",
        "description": "Introduction to the historiography on Latin America for the nineteenth century: world economy, nation-state building, agrarian processes, incipient industrialization, political and cultural thought, and social structure. Requirements will vary for undergraduate, MA, and PhD students. Graduate students are required to submit an additional research paper. "
    },
    "HILA 167/267": {
        "prerequisites": [],
        "name": "Scholarship on Latin American History in the Colonial Period",
        "description": "Introduction to the historiography on Latin America for the twentieth century: agrarian reforms, unionization, industrialization by import substitution, the political left, social development, and international relations. Requirements will vary for undergraduate, MA, and PhD students. Graduate students are required to submit an additional research paper. "
    },
    "HILA 171/271": {
        "prerequisites": [],
        "name": "Topics in Latin American History Since 1910",
        "description": "Directed readings for undergraduates under the supervision of various faculty members. "
    },
    "HINE 126": {
        "prerequisites": [],
        "name": "Iranian\n\t\t  Revolution in Historical Perspective",
        "description": "Cross-listed with JUDA 130. This course will study the historical books of the Hebrew Bible (in English), Genesis through 2 Kings, through a literary-historical approach: how, when, and why the Hebrew Bible came to be written down, its relationship with known historical facts, and the archaeological record. Students may not receive credit for both HINE 130 and JUDA 130. (Formerly known as JUDA 100A.) "
    },
    "HINE 127": {
        "prerequisites": [],
        "name": "History of Modern Turkey",
        "description": "Cross-listed with JUDA 131. This course will study the prophetic and poetic books of the Hebrew Bible (in English), through a literary-historical approach. Students may not receive credit for both HINE 131 and JUDA 131. (Formerly known as JUDA 100B.) "
    },
    "HINE 144": {
        "prerequisites": [],
        "name": "Topics in Middle Eastern History",
        "description": "The study of a single book, period, or issue on the Bible, in the context of the ancient Near Eastern world. Requirements will vary for undergraduate, master’s, and doctoral students. Graduate students may be required to submit a more substantial piece of work. "
    },
    "HINE 145": {
        "prerequisites": [],
        "name": "Islam and Science: The History of Science in the Middle East",
        "description": "This course approaches the Hebrew Bible (Old\n\t\t\t\t  Testament) from the perspective of cultural anthropology. Institutions\n\t\t\t\t  studied will include the family, rites of passage, food taboos, warfare,\n\t\t\t\t  animism, demons, sorcery, and animal sacrifice. Formerly HINE 111; students\n\t\t\t\t  may not receive credit for HINE 111 and HINE 162/262. Graduate students\n\t\t\t\t  will be required to complete an extra paper. "
    },
    "HINE 160/260": {
        "prerequisites": [],
        "name": "Special Topics in the Bible and Ancient Near East",
        "description": "A colloquium focusing on the problems and patterns in the emergence of modern Middle Eastern states since 1920. "
    },
    "HINE\n\t\t  162/262": {
        "prerequisites": [],
        "name": "Anthropology and the Hebrew Bible",
        "description": "Growth of nationalism in relation to imperialism,\n\t\t\t\t  religion, and revolution in the nineteenth- and twentieth-century Middle\n\t\t\t\t  East. Emergence of cultural and political ethnic consciousness in the Ottoman\n\t\t\t\t  state. Comparative study of Arab, Iranian, and Turkish nationalism as well\n\t\t\t\t  as Zionism. "
    },
    "HINE 165/265": {
        "prerequisites": [],
        "name": "The Colonial Mandates in the Middle East",
        "description": "This course studies a period or theme in Jewish history. Topics will vary from year to year. "
    },
    "HINE\n\t\t  186/286": {
        "prerequisites": [],
        "name": "Special Topics in Middle Eastern History",
        "description": "Directed readings for undergraduates under the supervision of various faculty members. "
    },
    "HISC 132": {
        "prerequisites": [],
        "name": "Israel—Start-up Nation",
        "description": "The complex historical development of human understanding of global climate change, including key scientific work, and the cultural dimensions of proof and persuasion. Special emphasis on the differential political acceptance of the scientific evidence in the United States and the world. Graduate students are required to submit an additional paper. "
    },
    "HISC 132GS": {
        "prerequisites": [],
        "name": "Israel—Start-up Nation",
        "description": "This seminar explores topics at the interface of science, technology, and culture, from the late nineteenth century to the present. Topics change yearly; may be repeated for credit with instructor’s permission. "
    },
    "HISC\n\t\t  163/263": {
        "prerequisites": [],
        "name": "History, Science, and Politics of Climate Change",
        "description": "Why have women been traditionally excluded from science? How has this affected scientific knowledge? How have scientists constructed gendered representations not only of women, but also of science and nature? We will address these questions from perspectives including history, philosophy, and psychoanalytic theory. "
    },
    "HISC 165": {
        "prerequisites": [],
        "name": "Topics\n\t\t  in Twentieth-Century Science and Culture",
        "description": "Examines evolutionary theory before Darwin, the development of the theory of natural selection, the ongoing challenge from Lamarckism, nineteenth-century social Darwinism, the emergence of the neo-Darwinist synthesis, and the recent controversies over evolutionary psychology and creationism. Graduate students are expected to submit an additional paper. "
    },
    "HISC 167/267": {
        "prerequisites": [],
        "name": "Gender and Science",
        "description": "From the beginnings of brain anatomy in the 1660s to the current rage for functional magnetic resonance imaging studies, this class investigates philosophical, ethical, and cultural dimensions of the quest to localize psychological phenomena in the physical brain. Graduate students are required to submit an additional paper. "
    },
    "HISC 173/273": {
        "prerequisites": [],
        "name": "Seminar on Darwin and Darwinisms",
        "description": "A critical analysis of the host of “historical\n\t\t\t\t  sciences” that developed over the course of the long nineteenth\n\t\t\t\t  century, from archaeology and paleontology to psychoanalysis and craniotomy,\n\t\t\t\t  including the science of history itself. Graduate students will be required\n\t\t\t\t  to submit an additional paper. "
    },
    "HISC 180/280": {
        "prerequisites": [],
        "name": "Science and Public Policy",
        "description": "Directed readings for undergraduates under the supervision of various faculty members. "
    },
    "HITO 103S": {
        "prerequisites": [],
        "name": "Gnosis and Gnosticism",
        "description": "This course explores Jewish women’s experiences from the seventeenth century to the present, covering Europe, the United States, and Israel. Examines work, marriage, motherhood, spirituality, education, community, and politics across three centuries and three continents. "
    },
    "HITO 160GS": {
        "prerequisites": [],
        "name": "Globalization and Diaspora",
        "description": "Topics will examine lesbian, gay, bisexual, transgender, and queer identities, communities, culture, and politics. May be repeated for credit two times, provided each course is a separate topic, for a maximum of twelve units. "
    },
    "HITO 164/264": {
        "prerequisites": [],
        "name": "Jews and Other Ethnics in the American Past",
        "description": "From early modern witches, rebels, and heretics to hypermodern gangsters, terrorists, and serial killers, applying capital punishment to foreign nationals and ethnic minorities has sustained a global conversation about the sanctity of human life and the meaning of citizenship in the Americas and Europe. Graduate students must complete an additional paper. "
    },
    "HITO 165/265": {
        "prerequisites": [],
        "name": "Topics—LGBT History",
        "description": "This course will examine what has been called the Cultural Cold Wars. Sports were the most visible form of popular culture during the era (1945–91). It will make use of reports and essays produced for an international, multiyear research project. It will combine written and visual sources. Matters of class, race, gender, and nationality will be discussed. May be coscheduled with HITO 267. "
    },
    "HITO\n\t\t  166/266": {
        "prerequisites": [],
        "name": "Death Penalty Global Perspectives since 1492",
        "description": "The course analyzes mutual influences and exchanges between the United States and Germany from the late nineteenth to the mid-twentieth century. Topics include imperialism and racism, social thought and intellectual migration, economic relations, feminism, and youth cultures, war, and occupation. Graduate students must complete an additional paper. "
    },
    "HITO 167/267": {
        "prerequisites": [],
        "name": "Global History of Sports in the Cold War",
        "description": "Reckoning by novelists, essayists, and biographers with the phenomenon of contemporary warfare as an unprecedented experience and an abiding threat. Graduate students are required to submit a more substantial piece of work. "
    },
    "HITO 168/268": {
        "prerequisites": [],
        "name": "The U.S. and Germany from the 1890s to the 1960s: Transitional Relations and Competing Modernities",
        "description": "Taught in conjunction with the San Diego Maritime Museum, this course investigates life at sea from the age of discovery to the advent of the steamship. We will investigate discovery, technology, piracy, fisheries, commerce, naval conflict, sea-board life, and seaport activity. "
    },
    "HITO\n\t\t  172/272": {
        "prerequisites": [],
        "name": "War in the Twentieth Century: A Psychological Approach",
        "description": "The majority of the world’s citizens now live in cities; this course examines the evolution of housing architecture and finance in the twentieth-century context of rapid urbanization, dissolving empire, industrialization, and globalization. Graduate students will submit a more substantial piece of work with in-depth analysis and with an increased number of sources cited. A typical undergraduate paper would be ten pages, whereas a typical graduate paper would require engagement with primary sources, more extensive reading of secondary material, and be about twenty pages. "
    },
    "HITO 178/278": {
        "prerequisites": [],
        "name": "A History of Seafaring in the Age of Sail",
        "description": "The Senior Seminar Program is designed to allow senior undergraduates to meet with faculty members in a small group setting to explore an intellectual topic in history (at the upper-division level). Topics will vary from quarter to quarter. Senior Seminars may be taken for credit up to four times, with a change in topic, and permission of the department. Enrollment is limited to twenty students, with preference given to seniors. "
    },
    "HITO 180/280": {
        "prerequisites": [],
        "name": "Housing in the Developing World",
        "description": "Course attached to six-unit internship taken by student participating in the UCDC program. Involves weekly seminar meetings with faculty and teaching assistant and a substantial historical research paper. "
    },
    "HITO 192": {
        "prerequisites": [],
        "name": "Senior Seminar in History",
        "description": "A program of independent study providing candidates for history honors an opportunity to develop, in consultation with an adviser, a preliminary proposal for the honors essay. An IP grade will be awarded at the end of this quarter. A final grade will be given for both quarters at the end of HITO 195. "
    },
    "HITO 193/POLI 194/COM GEN 194/USP 194": {
        "prerequisites": [],
        "name": "Research Seminar in Washington, DC",
        "description": "Independent study under the supervision of a faculty member leading to the preparation of an honors essay. A letter grade for both HITO 194 and 195 will be given at the completion of this quarter. "
    },
    "HITO 195": {
        "prerequisites": [],
        "name": "The Honors Essay",
        "description": "Directed group study on a topic not generally included in the regular curriculum. Students must make arrangements with individual faculty members. (P/NP grades only.) "
    },
    "HITO 196": {
        "prerequisites": [],
        "name": "Honors Seminar",
        "description": "Independent study on a topic not generally included in the regular curriculum. Students must make arrangements with individual faculty members. (P/NP grades only.) "
    },
    "HIUS 157": {
        "prerequisites": [],
        "name": "American\n\t\t  Women, American Womanhood 1870 to Present",
        "description": "Course explores the concept of an American Empire by examination of the literature on the topic. Particular attention will be on the work since 9/11/01. Students are expected to produce original work concerning the definition and/or existence of an American Empire. Graduate students are expected to submit an additional piece of work. "
    },
    "HIUS 158/ETHN\n\t\t  130": {
        "prerequisites": [],
        "name": "Social and Economic History of the Southwest I",
        "description": "This seminar will trace major themes in the history of the American West. Topics will include ethnicity, the environment, urbanization, demographics, and shifting concepts surrounding the significance of the West. Graduate students will be required to submit additional work in order to receive graduate credit for the course. "
    },
    "HIUS 159/ETHN\n\t\t  131": {
        "prerequisites": [],
        "name": "Social and Economic History of the Southwest II",
        "description": "This colloquium studies the racial representation of Mexican Americans in the United States from the nineteenth century to the present, examining critically the theories and methods of the humanities and social sciences. "
    },
    "HIUS\n\t\t  160/260": {
        "prerequisites": [],
        "name": "Colloquium on the American Empire",
        "description": "The course investigates race, resistance, and culture in the United States since the late nineteenth century. It interrogates how working-class whites, African Americans, Latinos, Asian Americans, and others have simultaneously challenged, shaped, and assimilated into US society. May be coscheduled with HIUS 268. "
    },
    "HIUS 162/262": {
        "prerequisites": [],
        "name": "The American West",
        "description": "A reading and discussion course on topics that vary from year to year, including American federalism, the history of civil liberties, and the Supreme Court. "
    },
    "HIUS 167/267/ETHN 180": {
        "prerequisites": [],
        "name": "Topics in Mexican American History",
        "description": "This seminar examines race and war in US history, with an emphasis on their intersections and co-constitutions. Topics include frontier wars and “manifest destiny;” border enforcement, antiradicalism, the war on drugs, and mass incarceration; and the war on terror. "
    },
    "HIUS 168/268": {
        "prerequisites": [],
        "name": "Race, Resistance, and Cultural Politics",
        "description": "This seminar will explore the histories of sexual relations, politics, and cultures that both cross and define racial boundaries in the nineteenth and twentieth centuries. Reading will focus on the United States as well as take up studies sited in Canada and Latin America. Graduate students are expected to submit a more substantial piece of work. "
    },
    "HIUS\n\t\t  169/269": {
        "prerequisites": [],
        "name": "Topics in American Legal and Constitutional History",
        "description": "This course explains the origin of the Atlantic as a zone of interaction for Europeans, indigenous Americans, and Africans, and evaluates the consequences of the interaction over several centuries by exploring contests over political power and economic/demographic change. Graduate students will submit a more substantial piece of work with in-depth analysis and with an increased number of sources cited. A typical undergraduate paper would be ten pages, whereas a typical graduate paper would require engagement with primary sources, more extensive reading of secondary material, and be about twenty pages. "
    },
    "HIUS 174": {
        "prerequisites": [],
        "name": "Race Wars in American Culture",
        "description": "Comparative study of immigration and ethnic-group formation in the United States from 1880 to the present. Topics include immigrant adaptation, competing theories about the experiences of different ethnic groups, and the persistence of ethnic attachments in modern American society. "
    },
    "HIUS 176/276": {
        "prerequisites": [],
        "name": "Race and Sexual Politics",
        "description": "A colloquium dealing with special topics in US history from 1900 to the present. Themes will vary from year to year. "
    },
    "HIUS 180/280/ETHN\n\t\t  134": {
        "prerequisites": [],
        "name": "Immigration and Ethnicity in Modern American Society",
        "description": "A colloquium dealing with special topics in the history of people of African descent in the United States. Course may be taken for credit up to three times, as topics will vary from quarter to quarter. "
    },
    "HIUS\n\t\t  181/281": {
        "prerequisites": [],
        "name": "Topics in Twentieth Century United States History",
        "description": "In this seminar, we will examine the shifting boundary between what constitutes a public and a private concern in twentieth-century US history. We will consider issues such as civil rights, immigration, health care, and the regulation of financial institutions. "
    },
    "HIUS 182": {
        "prerequisites": [],
        "name": "Special Topics in Intellectual History",
        "description": "Selected topics in US economic history. Course may be taken for credit a total of three times, as topics vary. "
    },
    "HIUS 183": {
        "prerequisites": [],
        "name": "Topics in African American History",
        "description": "Colloquium on select topics in culture and politics in the United States. Topics will vary from quarter to quarter. Graduate students will be required to submit an additional piece of work. "
    },
    "HIUS 186": {
        "prerequisites": [],
        "name": "Topics in US Economic History",
        "description": "Directed readings for undergraduates under the supervision of various faculty members. "
    },
    "HIUS 198": {
        "prerequisites": [],
        "name": "Directed Group Study",
        "description": "This seminar examines race and war in US history, with an emphasis on their intersections and co-constitutions. Topics include frontier wars and “manifest destiny”; border enforcement; antiradicalism; the war on drugs and mass incarceration; and the war on terror. May be coscheduled with HIUS 174. "
    }
}