{
    "LATI 10": {
        "prerequisites": [],
        "name": "Reading North by South: Latin American Studies and the US Liberation Movements",
        "description": "The purpose of this class is to study the multilayered relations between Latin American studies and the US liberation movements, particularly Third World movements, the Chicano movement, the black liberation movement, the indigenous movement, human rights activism, and trans-border activism. Students may not receive credit for LATI 100 and LATI 10."
    },
    "LATI 50": {
        "prerequisites": [],
        "name": "Introduction to Latin America",
        "description": "Interdisciplinary overview of society and culture in Latin America—including Mexico, the Caribbean, and South America: legacies of conquest, patterns of economic development, changing roles of women, expressions of popular culture, cycles of political change, and US-Latin American relations. "
    },
    "LATI 87": {
        "prerequisites": [],
        "name": "Freshman Seminar",
        "description": "The Freshman Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. Freshman Seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering freshmen. "
    },
    "LATI 122A": {
        "prerequisites": [],
        "name": "Field Research Methods for Migration Studies: Seminar",
        "description": "Introductory survey of methods used by social and health scientists to gather primary research data on international migrant and refugee populations, including sample surveys, unstructured interviewing, and ethnographic observation. Basic fieldwork practices, ethics, and problem-solving techniques will also be covered. Students may not receive credit for both SOCI 122A and LATI 122A. Recommended: advanced competency in conversational Spanish. "
    },
    "LATI 122B": {
        "prerequisites": [
            "LATI 122A"
        ],
        "name": "Field Research Methods for Migration Studies: Practicum",
        "description": "Students will collect survey and qualitative data among Mexican migrants to the United States and potential migrants, participate in team research, organize data collected for analysis, and submit a detailed outline of an article to be based on field data. Students may not receive credit for both SOCI 122B and LATI 122B. Recommended: advanced competency in conversational Spanish. "
    },
    "LATI 122C": {
        "prerequisites": [
            "LATI 122B"
        ],
        "name": "Field Research Methods for Migration Studies: Data Analysis",
        "description": "Continuation of SOCI 122B. Students analyze primary data they have collected in field research sites and coauthor an article for publication. Methods for organizing and processing field data, techniques of quantitative data analysis, and report preparation conventions will be covered. Students may not receive credit for both SOCI 122C and LATI 122C. "
    },
    "LATI 180": {
        "prerequisites": [
            "LATI 50"
        ],
        "name": "Special Topics in Latin American Studies",
        "description": "Readings and discussion of substantive issues and research in Latin American studies. Topics may include the study of a specific society or a particular issue in comparative cross-national perspective. Topics will vary from year to year. "
    },
    "LATI 190": {
        "prerequisites": [
            "LATI 50",
            "and"
        ],
        "name": "Senior Seminar",
        "description": "Research seminar on selected topics in the study of Latin America; all students will be required to prepare and present independent research papers. (Honors students will present drafts of senior research theses, of no less than fifty pages in length; nonhonors students will present final versions of analytical papers of approximately twenty-five to forty pages in length.) "
    },
    "LATI 191": {
        "prerequisites": [
            "LATI 50"
        ],
        "name": "Honors Seminar",
        "description": "Independent reading and research under direction of a member of the faculty group in Latin American Studies; goal is to provide honors students with an opportunity to complete senior research thesis (to be defended before three-person interdisciplinary faculty committee). "
    },
    "LATI 199": {
        "prerequisites": [
            "LATI 50",
            "and"
        ],
        "name": "Individual Study",
        "description": "Guided and supervised reading of the literature on Latin America in the interdisciplinary areas of anthropology, communications, economics, history, literature, political science, and sociology. For students majoring in Latin American Studies, reading will focus around potential topics for senior papers; for honors students in Latin American Studies, reading will culminate in formulation of a prospectus for the research thesis. "
    }
}