{
    "PHIL 27": {
        "prerequisites": [
            "CAT 2",
            "and",
            "or",
            "DOC 2",
            "and",
            "and",
            "HUM 1",
            "and",
            "and",
            "and"
        ],
        "name": "Ethics and Society",
        "description": "An examination of ethical principles (e.g., utilitarianism, individual rights, etc.) and their social and political applications to contemporary issues: abortion, environmental protection, and affirmative action. Ethical principles will also be applied to moral dilemmas in government, law, business, and the professions. Warren College students must take course for a letter grade in order to satisfy the Warren College general-education requirement. "
    },
    "PHIL 28": {
        "prerequisites": [
            "PHIL 27",
            "or",
            "POLI 27"
        ],
        "name": "Ethics and Society II",
        "description": "An examination of a single set of major contemporary social, political, or economic issues (e.g., environmental ethics, international ethics) in light of ethical and moral principles and values. Warren College students must take course for a letter grade in order to satisfy the Warren College general-education requirement. "
    },
    "PHIL 87": {
        "prerequisites": [],
        "name": "Freshman Seminar",
        "description": "A study of Socrates and/or Plato through major dialogues of Plato. Possible topics include the virtues and happiness; weakness of the will; political authority and democracy; the theory of Forms and sensible flux; immortality; relativism, skepticism, and knowledge. May be repeated for credit with change of content and approval of instructor. "
    },
    "PHIL 90": {
        "prerequisites": [],
        "name": "Basic Problem in Philosophy",
        "description": "A study of major issues in Aristotle’s works, such as the categories; form and matter; substance, essence, and accident; the soul; virtue, happiness, and politics. "
    },
    "PHIL 100": {
        "prerequisites": [],
        "name": "Plato",
        "description": "A study of selected texts from the main schools of Hellenistic philosophy—Stoicism, Epicureanism, and Skepticism. "
    },
    "PHIL 101": {
        "prerequisites": [],
        "name": "Aristotle",
        "description": "A study of one or more figures from seventeenth- and/or eighteenth-century philosophy, such as Bacon, Descartes, Hobbes, Cavendish, Conway, Spinoza, Locke, Malebranche, Leibniz, Astell, Berkeley, Du Chatelet, Hume, or Reid. The focus may be on particular texts or intellectual themes and traditions. May be taken for credit up to two times. "
    },
    "PHIL 102": {
        "prerequisites": [
            "PHIL 32"
        ],
        "name": "Hellenistic Philosophy",
        "description": "A study of selected portions of The Critique of Pure Reason and other theoretical writings and/or his major works in moral theory. May be repeated for credit with change in content and approval of the instructor. "
    },
    "PHIL 105": {
        "prerequisites": [],
        "name": "Topics in Early Modern Philosophy ",
        "description": "A study of one or more of Hegel’s major works, in particular, The Phenomenology of Spirit and The Philosophy of Right. Readings and discussion may also include other figures in the Idealist tradition—such as Fichte, Hölderlin, and Schelling—and critics of the Idealist tradition—such as Marx and Kierkegaard. "
    },
    "PHIL 106": {
        "prerequisites": [],
        "name": "Kant",
        "description": "A study of one or more figures in nineteenth-century philosophy, such as Schopenhauer, Nietzsche, Kierkegaard, Marx, Emerson, Thoreau, Goldman, Luxemburg, James, and Mill.  The focus may be on particular figures or intellectual themes and traditions. May be repeated for credit with change of content and approval of instructor. "
    },
    "PHIL 107": {
        "prerequisites": [],
        "name": "Hegel",
        "description": "Central texts, figures, and traditions in\n\t\t\t\t  analytic philosophy. Figures may include Frege, Russell, Wittgenstein, Carnap, Moore, Austin, Quine, and Anscombe.  May be repeated for credit with change of content and\n\t\t\t\t  approval of the instructor. "
    },
    "PHIL 108": {
        "prerequisites": [],
        "name": "Nineteenth-Century Philosophy",
        "description": "An examination of ancient Greek philosophy, focusing on major works of Plato and Aristotle. PHIL 10, PHIL 111, and PHIL 112 should be taken in order. "
    },
    "PHIL 109": {
        "prerequisites": [
            "PHIL 110",
            "and"
        ],
        "name": "History of Analytic Philosophy",
        "description": "An examination of seventeenth- and eighteenth-century philosophy, focusing on major works of Descartes, Locke, and Hume. PHIL 110, PHIL 111, and PHIL 112 should be taken in order. "
    },
    "PHIL 110": {
        "prerequisites": [
            "PHIL 111",
            "and"
        ],
        "name": "History of Philosophy: Ancient",
        "description": "An examination of late eighteenth and nineteenth-century philosophy, focusing on major works of Kant and Hegel. PHIL 110, PHIL 111, and PHIL 112 should be taken in order. "
    },
    "PHIL 111": {
        "prerequisites": [],
        "name": "History of Philosophy: Early Modern",
        "description": "This course provides an introduction to the techniques of philosophical inquiry through detailed study of selected philosophical texts and through extensive training in philosophical writing based on those texts. Enrollment limited and restricted to majors; must be taken for letter grade. May not be repeated for credit. "
    },
    "PHIL 112": {
        "prerequisites": [
            "PHIL 10"
        ],
        "name": "History of Philosophy: Late Modern",
        "description": "The syntax, semantics, and proof-theory of first-order predicate logic with identity, emphasizing both conceptual issues and practical skills (e.g., criteria for logical truth, consistency, and validity; the application of logical methods to everyday as well as scientific reasoning). "
    },
    "PHIL 115": {
        "prerequisites": [
            "PHIL 120"
        ],
        "name": "Philosophical Methods Seminar",
        "description": "Topics vary from year to year. They include Metalogic (Mathematical Logic), Modal Logic, Foundations of Logic, Foundations of Set Theory, Gödel’s Incompleteness Theorems, and others. "
    },
    "PHIL 120": {
        "prerequisites": [
            "PHIL 120"
        ],
        "name": "Symbolic Logic I",
        "description": "Philosophical issues underlying standard and nonstandard logics, the nature of logical knowledge, the relation between logic and mathematics, the revisability of logic, truth and logic, ontological commitment and ontological relativity, logical consequence, etc. May be repeated for credit with change in content and approval of instructor. "
    },
    "PHIL 122": {
        "prerequisites": [
            "PHIL 120"
        ],
        "name": "Advanced Topics in Logic",
        "description": "The character of logical and mathematical truth and knowledge; the relations between logic and mathematics; the significance of Gödel’s Incompleteness Theorem; Platonism, logicism, and more recent approaches. "
    },
    "PHIL 123": {
        "prerequisites": [],
        "name": "Philosophy of Logic",
        "description": "Central problems in metaphysics, such as free will and determinism, the mind-body problem, personal identity, causation, primary and secondary qualities, the nature of universals, necessity, and identity. "
    },
    "PHIL 124": {
        "prerequisites": [],
        "name": "Philosophy of Mathematics",
        "description": "An in-depth study of some central problem, figure, or tradition in metaphysics. May be repeated for credit with change of content and approval of instructor. "
    },
    "PHIL 130": {
        "prerequisites": [],
        "name": "Metaphysics",
        "description": "Central problems in epistemology such as skepticism; a priori knowledge; knowledge of other minds; self-knowledge; the problem of induction; foundationalist, coherence, and causal theories of knowledge. "
    },
    "PHIL 131": {
        "prerequisites": [],
        "name": "Topics in Metaphysics",
        "description": "Examination of contemporary debates about meaning, reference, truth, and thought. Topics include descriptional theories of reference, sense and reference, compositionality, truth, theories of meaning, vagueness, metaphor, and natural and formal languages. "
    },
    "PHIL 132": {
        "prerequisites": [],
        "name": "Epistemology",
        "description": "Different conceptions of the nature of mind and its relation to the physical world. Topics include identity theories, functionalism, eliminative materialism, internalism and externalism, subjectivity, other minds, consciousness, self-knowledge, perception, memory, and imagination. "
    },
    "PHIL 134": {
        "prerequisites": [],
        "name": "Philosophy of Language",
        "description": "The nature of action and psychological explanation. Topics include action individuation, reasons as causes, psychological laws, freedom and responsibility, weakness of will, self-deception, and the emotions. "
    },
    "PHIL 136": {
        "prerequisites": [],
        "name": "Philosophy of Mind",
        "description": "A study of the nature and significance of responsibility. Possible topics include freedom, determinism, and responsibility; moral luck; responsibility and reactive attitudes such as blame and forgiveness; responsibility and situationism; moral and criminal responsibility; responsibility and excuse; insanity and psychopathy, immaturity, addiction, provocation, and duress. "
    },
    "PHIL 137": {
        "prerequisites": [],
        "name": "Moral Psychology",
        "description": "Social justice issues as they arise across the borders of nation-states. Topics may include nationalism and cosmopolitanism, theories of just war and just warfare, issues of migration and immigration, global distributive justice and fair trade, and international cooperation in the face of global problems such as climate change and human rights violations. "
    },
    "PHIL 138": {
        "prerequisites": [],
        "name": "Responsibility",
        "description": "Investigation into the nature of free will, including arguments for and against its compatibility with a scientific picture of the world and competing accounts of the metaphysics of free will. Possible topics include disputes about the nature of free will; what it is for agents to cause actions; the nature of abilities or capacities to act; the relevance of neuroscience to accounts of free will; whether free will skepticism is a stable view; and experimental research on free will. "
    },
    "PHIL 139": {
        "prerequisites": [],
        "name": "Global Justice",
        "description": "This course considers whether human life has meaning, and, if so, what meaning it has and under what conditions such meaning may be secured. Negative proposals considered include that life is nothing but suffering, that it is absurd, that it has no meaning. Positive proposals considered include that meaning derives from free choices, from just being, from some passion, from something transcendent, or from human relationships or purposeless play or knowledge or achievement or morality. "
    },
    "PHIL 140": {
        "prerequisites": [],
        "name": "Free Will",
        "description": "Central problems in philosophy of science, such as the nature of confirmation and explanation, the nature of scientific revolutions and progress, the unity of science, and realism and antirealism. "
    },
    "PHIL 141": {
        "prerequisites": [],
        "name": "The Meaning of Life",
        "description": "Philosophical problems in the development of modern physics, such as the philosophy of space and time, the epistemology of geometry, the philosophical significance of Einstein’s theory of relativity, the interpretation of quantum mechanics, and the significance of modern cosmology. "
    },
    "PHIL 145": {
        "prerequisites": [],
        "name": "Philosophy of Science",
        "description": "Philosophical problems in the biological sciences, such as the relation between biology and the physical sciences, the status and structure of evolutionary theory, and the role of biology in the social sciences. "
    },
    "PHIL 146": {
        "prerequisites": [],
        "name": "Philosophy of Physics",
        "description": "Investigation of ethical and epistemological questions concerning our relationship to the environment. Topics may include the value of nature, biodiversity, policy and science, and responsibility to future generations. "
    },
    "PHIL 147": {
        "prerequisites": [],
        "name": "Philosophy of Biology",
        "description": "Philosophical issues raised by psychology, including the nature of psychological explanation, the role of nature versus nurture, free will and determinism, and the unity of the person. "
    },
    "PHIL 148": {
        "prerequisites": [],
        "name": "Philosophy and the Environment",
        "description": "Theoretical, empirical, methodological, and\n\t\t\t\t  philosophical issues at work in the cognitive sciences (e.g., psychology,\n\t\t\t\t  linguistics, neuroscience, artificial intelligence, and computer science),\n\t\t\t\t  concerning things such as mental representation, consciousness, rationality,\n\t\t\t\t  explanation, and nativism. "
    },
    "PHIL 149": {
        "prerequisites": [],
        "name": "Philosophy of Psychology",
        "description": "An introduction to elementary neuroanatomy and neurophysiology and an examination of theoretical issues in cognitive neuroscience and their implications for traditional philosophical conceptions of the relation between mind and body, perception, consciousness, understanding, emotion, and the self. "
    },
    "PHIL 150": {
        "prerequisites": [],
        "name": "Philosophy of the Cognitive Sciences",
        "description": "Philosophical issues of method and substance in the social sciences, such as causal and interpretive models of explanation, structuralism and methodological individualism, value neutrality, and relativism. "
    },
    "PHIL 152": {
        "prerequisites": [],
        "name": "Philosophy of Social Science",
        "description": "Philosophical issues surrounding Latina/o/x peoples, which may include debates about the nature, function, and stability of this identity; social and political issues, such as immigration, economics, racial politics, and justice; phenomenological and existential accounts of latinidad; Latina feminism; and the relationship of these concerns to other philosophical traditions. "
    },
    "PHIL 155": {
        "prerequisites": [],
        "name": "Mexican Philosophy",
        "description": "Systematic and/or historical perspectives on central issues in ethical theory such as deontic, contractualist, and consequentialist conceptions of morality; rights and special obligations; the role of happiness and virtue in morality; moral conflict; ethical objectivity and relativism; and the rational authority of morality. "
    },
    "PHIL 156": {
        "prerequisites": [],
        "name": "Latinx Philosophy",
        "description": "Central issues and texts in the history of ethics. Subject matter can vary, ranging from one philosopher (e.g., Confucius, Aristotle,  Kant, or Mill) to a historical tradition (e.g., Greek ethics or the British moralists). May be repeated for credit with change in content and approval of instructor. "
    },
    "PHIL 160": {
        "prerequisites": [],
        "name": "Ethical Theory",
        "description": "An examination of contemporary moral issues, such as abortion, euthanasia, war, affirmative action, and freedom of speech. "
    },
    "PHIL 161": {
        "prerequisites": [],
        "name": "Topics in the History of Ethics",
        "description": "Moral issues in medicine and the biological sciences, such as patient’s rights and physician’s responsibilities, abortion and euthanasia, the distribution of health care, experimentation, and genetic intervention. "
    },
    "PHIL 162": {
        "prerequisites": [],
        "name": "Contemporary Moral Issues",
        "description": "Philosophical issues involved in the development of modern science, the growth of technology, and control of the natural environment. The interaction of science and technology with human nature and political and moral ideals. "
    },
    "PHIL 163": {
        "prerequisites": [],
        "name": "Biomedical Ethics",
        "description": "Examination of freedom and equality under the US Constitution, focusing on Supreme Court cases concerning discrimination on grounds of race, ethnic background, gender, undocumented status, wealth, and sexual orientation, and cases regarding contraceptives, abortion, interracial marriage, polygamy, and same-sex marriage. "
    },
    "PHIL 164": {
        "prerequisites": [],
        "name": "Technology and Human Values",
        "description": "Central issues about the justification, proper functions, and limits of the state through classic texts in the history of political philosophy by figures such as Plato, Aristotle, Hobbes, Locke, Rousseau, Marx, and Arendt. "
    },
    "PHIL 165": {
        "prerequisites": [],
        "name": "Freedom, Equality, and the Law",
        "description": "Different perspectives on central issues in contemporary political philosophy, such as the nature of state authority and political obligation, the limits of government and individual liberty, liberalism and its critics, equality and distributive justice. "
    },
    "PHIL 166": {
        "prerequisites": [],
        "name": "Classics in Political Philosophy",
        "description": "A study of issues in analytical jurisprudence such as the nature of law, the relation between law and morality, and the nature of legal interpretation and issues in normative jurisprudence such as the justification of punishment, paternalism and privacy, freedom of expression, and affirmative action. "
    },
    "PHIL 167": {
        "prerequisites": [],
        "name": "Contemporary Political Philosophy",
        "description": "Philosophical examination of core concepts and theses in feminism, feminist philosophy, and critiques of traditional philosophical approaches to morality, politics, and science, from a feminist perspective. May also treat the historical development of feminist philosophy and its critiques. May be taken for credit two times with permission of instructor. "
    },
    "PHIL 168": {
        "prerequisites": [],
        "name": "Philosophy of Law",
        "description": "A philosophical investigation of the topics of race and racism. The role of “race” in ordinary speech. The ethics of racial discourse. Anthropological and biological conceptions of race. The social and political significance of racial categories. Post-racialist conceptions of race. "
    },
    "PHIL 169": {
        "prerequisites": [],
        "name": "Feminism and Philosophy",
        "description": "An in-depth exploration of an issue in bioethics. Topics will vary, and may include the ethics of genetic engineering, mental capacity and genuinely informed consent, the just distribution of health care, the ethics of geo-engineering, and the ethics of climate change and health. May be taken for credit two times. "
    },
    "PHIL 170": {
        "prerequisites": [],
        "name": "Philosophy and Race",
        "description": "A survey of ethical issues arising in the collection, storage, analysis, consolidation, and application of data. Topics may include data as property and public resource, privacy and surveillance, data and discrimination, algorithms and fairness, and data regulation. "
    },
    "PHIL 173": {
        "prerequisites": [],
        "name": "Topics in Bioethics",
        "description": "Central issues in philosophical aesthetics such as the nature of art and aesthetic experience, the grounds of artistic interpretation and evaluation, artistic representation, and the role of the arts in education, culture, and politics. May be taken for credit two times.  "
    },
    "PHIL 174": {
        "prerequisites": [],
        "name": "Data Ethics",
        "description": "A study of philosophical themes contained in selected fiction, drama, or poetry, and the philosophical issues that arise in the interpretation, appreciation, and criticism of literature. "
    },
    "PHIL 175": {
        "prerequisites": [],
        "name": "Aesthetics",
        "description": "Careful, line-by-line translation of passages of intermediate difficulty from German philosophical texts, both classic (Kant, Fichte, Hegel, Schopenhauer) and contemporary (Heidegger, Wittgenstein, Habermas). P/NP grades only. May be taken for credit six times as topics vary. LIGM 1D or equivalent level of study recommended.  "
    },
    "PHIL 177": {
        "prerequisites": [
            "PHIL 178"
        ],
        "name": "Philosophy and Literature",
        "description": "Continuation of PHIL 178 in the careful, line-by-line translation of passages of advanced difficulty from German philosophical texts, both classic (Kant, Fichte, Hegel, Schopenhauer) and contemporary (Heidegger, Wittgenstein, Habermas). May be repeated for credit as topics vary. "
    },
    "PHIL 178": {
        "prerequisites": [],
        "name": "Topics in German Philosophy Translation—Intermediate",
        "description": "An examination of the phenomenological tradition through the works of its major classical and/or contemporary representatives. Authors studied will vary and may include Brentano, Husserl, Heidegger, Stein, Merleau-Ponty, Levinas, and Irigaray. "
    },
    "PHIL 179": {
        "prerequisites": [],
        "name": "Topics in German Philosophy Translation—Advanced",
        "description": "Classical texts and issues of existentialism. Authors studied will vary and may include Nietzsche, Kierkegaard, Heidegger, Sartre, de Beauvoir, and Fanon.  "
    },
    "PHIL 180": {
        "prerequisites": [],
        "name": "Phenomenology",
        "description": "The focus will be on a leading movement in continental philosophy (e.g., the critical theory of the Frankfurt school, structuralism and deconstruction, postmodernism) or some particular issue that has figured in these traditions (e.g., freedom, subjectivity, historicity, authenticity). May be repeated for credit with change in content and approval of instructor. "
    },
    "PHIL 181": {
        "prerequisites": [],
        "name": "Existentialism",
        "description": "A general introduction to the philosophy of religion through the study of classical and/or contemporary texts. Among the issues to be discussed are the existence and nature of God, the problem of evil, the existence of miracles, the relation between reason and revelation, and the nature of religious language. "
    },
    "PHIL 183": {
        "prerequisites": [],
        "name": "Topics in Continental Philosophy",
        "description": "Independent study by special arrangement with and under the supervision of a faculty member, including a proposal for the honors essay. An IP grade will be awarded at the end of this quarter; a final grade will be given for both quarters at the end of 191B. "
    },
    "PHIL 185": {
        "prerequisites": [],
        "name": "Philosophy of Religion",
        "description": "Continuation of 191A: independent study by special arrangement with and under the supervision of a faculty member, leading to the completion of the honors essay. A letter grade for both 191A and 191B will be given at the end of this quarter. "
    },
    "PHIL 191A": {
        "prerequisites": [],
        "name": "Philosophy Honors",
        "description": "Under the supervision of the instructor, student will lead one discussion section of a lower-division philosophy class. The student must attend the lecture for the class and meet regularly with the instructor. Applications are available in the Department of Philosophy. "
    },
    "PHIL 191B": {
        "prerequisites": [],
        "name": "The Honors Essay",
        "description": "Directed individual study by special arrangement with and under the supervision of a faculty member. (P/NP grades only.) "
    }
}