{
    "HISC 160": {
        "prerequisites": [],
        "name": "Historical Approaches to the Study of Science\n\t   ",
        "description": "This colloquium course will introduce students to the rich variety of ways in which the scientific enterprise is currently being studied historically. Major recent publications on specific topics in the history of science selected to illustrate this diversity will be discussed and analyzed; the topics will range in period from the seventeenth century to the late twentieth, and will deal with all major branches of natural science. Requirements will vary for undergraduate, MA, and PhD students. Graduate students may be expected to submit a more substantial piece of work.  ** Consent of instructor to enroll possible  **"
    },
    "HISC 161/261": {
        "prerequisites": [],
        "name": "Seminar in Newton and Newtonianism",
        "description": "This course focuses on the single most important figure of the scientific revolution, Isaac Newton, and on his science and philosophy, which set the frame of reference for physics and general science until the twentieth century. Graduate students are required to submit an additional piece of work.  ** Upper-division standing required ** "
    },
    "HISC 163/263": {
        "prerequisites": [],
        "name": "History, Science, and Politics of Climate\n\t    Change",
        "description": "The complex historical development of human understanding of global climate change, including key scientific work, and the cultural dimensions of proof and persuasion. Special emphasis on the differential political acceptance of the scientific evidence in the U.S. and the world. Graduate students are required to submit an additional paper. "
    },
    "HISC 164/264": {
        "prerequisites": [],
        "name": "Topics in the History of the Physical\n\t    Sciences",
        "description": "Intensive study of specific problems in the physical (including chemical and mathematical) sciences, ranging in period from the Renaissance to the twentieth century. Topics vary from year to year, and students may therefore repeat the course for credit. Requirements will vary for undergraduate, MA, and PhD students. Graduate students may be expected to submit a more substantial piece of work.  ** Consent of instructor to enroll possible  **"
    },
    "HISC 165": {
        "prerequisites": [],
        "name": "Topics in Twentieth-Century Science and\n\t    Culture",
        "description": "This is a seminar open to advanced undergraduate and graduate students that explores topics at the interface of science, technology, and culture, from the late nineteenth century to the present. Topics change yearly; may be repeated for credit with instructor’s consent. Requirements vary for undergraduates, MA, and PhD students. Graduate students are required to submit a more substantial piece of work.  ** Consent of instructor to enroll possible  ** ** Upper-division standing required ** "
    },
    "HISC 166/266": {
        "prerequisites": [],
        "name": "The Galileo Affair",
        "description": "Galileo’s condemnation by the Catholic Church in 1633 is a well-known but misunderstood episode. Was Galileo punished for holding dangerous scientific views? Personal arrogance? Disobedience? Religious transgressions? Readings in original sources, recent historical interpretations. Graduate students will be expected to submit a more substantial piece of work.  ** Consent of instructor to enroll possible  ** ** Upper-division standing required ** "
    },
    "HISC 167/267": {
        "prerequisites": [],
        "name": "Gender and Science",
        "description": "Why have women been traditionally excluded from science? How has this affected scientific knowledge? How have scientists constructed gendered representations not only of women, but also of science and nature? We will address these questions from perspectives including history, philosophy, and psychoanalytic theory.  ** Consent of instructor to enroll possible  ** ** Upper-division standing required ** "
    },
    "HISC 170/270": {
        "prerequisites": [],
        "name": "Topics in the History of Science and\n\t    Technology",
        "description": "This seminar explores topics at the interface of science, technology, and society, ranging from the seventeenth century to the twentieth. Requirements will vary for undergraduate, MA, and PhD students. Graduate students are required to submit an additional paper.  ** Consent of instructor to enroll possible  ** ** Upper-division standing required ** "
    },
    "HISC 172/272": {
        "prerequisites": [],
        "name": "Building America: Technology, Culture, and the Built Environment in the United States",
        "description": "The history of the built environment in the United States, from skyscrapers to suburbs, canals and railroads to factories and department stores. The technological history of structures and infrastructures, and the social and cultural values that have been “built into” our material environment. Graduate students are required to submit an additional paper.  ** Consent of instructor to enroll possible  ** ** Upper-division standing required ** "
    },
    "HISC 180/280": {
        "prerequisites": [],
        "name": "Science and Public Policy",
        "description": "This course will explore the evolution of the institutions, ideologies, procedures, standards, and expertise that modern democratic societies have used in applying science to generate and legitimate public policy. In order to obtain the department stamp, please email the professor for the OK to enroll. Once you have that email, please forward it to historyundergrad@ucsd.edu and include your PID number. Graduate students are required to submit an additional paper.  ** Upper-division standing required ** "
    }
}