{
    "SE 1": {
        "prerequisites": [],
        "name": "Introduction to Structures and Design",
        "description": "Introduction to fundamentals of structures and how structures work. Overview of structural behavior and structural design process through hands-on projects. Lessons learned from structural failures. Professional ethics. Role and responsibility of structural engineers. Introduction to four structural engineering focus sequences. Program or materials fees may apply. Priority enrollment given to structural engineering majors."
    },
    "SE 2": {
        "prerequisites": [
            "CHEM 6A",
            "PHYS 2A"
        ],
        "name": "Structural Materials",
        "description": "Properties and structures of engineering materials, including metals and alloys, ceramics, cements and concretes, polymers, and composites. Elastic deformation, plastic deformation, fracture, fatigue, wearing, and corrosion. Selection of engineering materials based on performance and cost requirements. "
    },
    "SE 2L": {
        "prerequisites": [
            "CHEM 6A",
            "PHYS 2A",
            "and",
            "SE 2"
        ],
        "name": "Structural Materials Lab",
        "description": "Materials testing and/or processing for metals and alloys, polymers and composites, cements, and wood. Materials selection and structural design to meet functional and cost requirements. Structural construction and testing. Use of computer resources. "
    },
    "SE 3": {
        "prerequisites": [
            "SE 1"
        ],
        "name": "Graphical Communication for Engineering Design",
        "description": "Use of computer graphics (CAD software) to communicate engineering designs. Includes visualization, sketching, 2D and 3D graphics standards, dimensioning, tolerance, assemblies, and prototyping/testing with light manufacturing methods. Project/system management software, i.e., building information modeling (BIM), will be introduced. Use of computer resources. "
    },
    "SE 7": {
        "prerequisites": [],
        "name": "Spatial Visualization",
        "description": "Spatial visualization is the ability to manipulate 2D and 3D shapes in one’s mind. In this course, students will perform exercises that increase their spatial visualization skills. P/NP grades only. Students may not receive credit for SE 7 and MAE 7. "
    },
    "SE 9": {
        "prerequisites": [
            "MATH 20D",
            "and",
            "MATH 18"
        ],
        "name": "Algorithms and Programming for Structural Engineering",
        "description": "Introduction to the Matlab environment. Variables and types, statements, functions, blocks, loops, and branches. Algorithm development. Functions, function handles, input and output arguments. Data encapsulation and object-oriented programming. Toolboxes and libraries. Models from physics (mechanics and thermodynamics) are used in exercises and projects. "
    },
    "SE 87": {
        "prerequisites": [],
        "name": "Freshman Seminar",
        "description": "The Freshman Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. Freshman Seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. "
    },
    "SE 99H": {
        "prerequisites": [],
        "name": "Independent Study",
        "description": "Independent study or research under direction of a faculty member.  ** Consent of instructor to enroll possible  ** ** Upper-division standing required ** "
    },
    "SE 101A": {
        "prerequisites": [],
        "name": "Mechanics I: Statics",
        "description": " "
    },
    "SE 101B": {
        "prerequisites": [
            "MATH 20C",
            "and",
            "PHYS 2A"
        ],
        "name": "Mechanics II: Dynamics",
        "description": "Principles of statics using vectors. Two- and three-dimensional equilibrium of statically determinate structures under discrete and distributed loading including hydrostatics; internal forces and concept of stress; free body diagrams; moment, product of inertia; analysis of trusses and beams. "
    },
    "SE 101C": {
        "prerequisites": [
            "SE 101A",
            "MAE 130A"
        ],
        "name": "Mechanics III: Vibrations",
        "description": "Kinematics and kinetics of particles in two- and three-dimensional motion. Newton’s equations of motion. Energy and momentum methods. Impulsive motion and impact. Systems of particles. Kinetics and kinematics of rigid bodies in 2-D. Introduction to 3-D dynamics of rigid bodies. "
    },
    "SE 103": {
        "prerequisites": [
            "MATH 18",
            "and",
            "SE 101B",
            "MAE 130B"
        ],
        "name": "Conceptual Structural Design",
        "description": "Free and forced vibrations of damped 1-DOF systems; vibrations isolation, impact and packaging problems. Analysis of discrete MDOF systems using matrix representation; normal mode of frequencies and modal matrix formulation. Lagrange’s equations. Modal superposition for analysis of continuous vibrating systems. "
    },
    "SE 104": {
        "prerequisites": [
            "SE 9",
            "SE 101A",
            "MAE 130A",
            "SE 104",
            "and",
            "SE 104L"
        ],
        "name": "Structural Materials",
        "description": "Introduction to structural design approaches for civil structures. Structural materials. Loads and load paths. Gravity and lateral load elements and systems. Code design fundamentals. Construction methods. Structural idealization. Hand and computer methods of analysis. Experimental methods applied through team-based projects. Program or materials fees may apply. "
    },
    "SE 104L": {
        "prerequisites": [
            "SE 1",
            "and",
            "SE 101A",
            "or",
            "MAE 130A"
        ],
        "name": "Structural Materials Lab",
        "description": "Properties and structures of engineering materials, including metals and alloys, ceramics, cements and concretes, wood, polymers, and composites. Elastic deformation, plastic deformation, fracture, fatigue, creep. Selection of engineering materials based on performance and cost requirements. Measurement techniques. "
    },
    "SE 110A": {
        "prerequisites": [
            "MATH 20D",
            "and",
            "SE 101A",
            "MAE 130A"
        ],
        "name": "Solid Mechanics I",
        "description": "Concepts of stress and strain. Hooke’s law. Stress transformation. Axial loading of bars. Torsion of circular shafts. Torsion of thin-walled members. Pure bending of beams. Unsymmetric bending of beams. Shear stresses in beams. Shear stresses in thin-walled beams. Shear center. Differential equation of the deflection curve. Deflections and slopes of beams from integration methods. Statically determinate and indeterminate problems. "
    },
    "SE 110B": {
        "prerequisites": [
            "SE 110A",
            "MAE 131A",
            "SE majors"
        ],
        "name": "Solid Mechanics II",
        "description": "Advanced concepts in the mechanics of deformable bodies. Unsymmetrical bending of symmetrical and unsymmetrical sections. Bending of curved beams. Shear center and torsional analysis of open and closed sections. Stability analysis of columns, lateral buckling. Application of the theory of elasticity in rectangular coordinates. "
    },
    "SE 115": {
        "prerequisites": [
            "PHYS 2A",
            "and",
            "MATH 20D"
        ],
        "name": "Fluid Mechanics for Structural Engineering",
        "description": "Fluid statics, hydrostatic forces; integral and differential forms of conservation equations for mass, momentum, and energy; Bernoulli equation; dimensional analysis; viscous pipe flow; external flow, boundary layers; open channel flow.  ** Consent of instructor to enroll possible  **"
    },
    "SE 120": {
        "prerequisites": [
            "SE 102",
            "and",
            "SE 103",
            "SE majors"
        ],
        "name": "Engineering Graphics & Computer\n\t\t  Aided Structural Design",
        "description": "Engineering graphics, solid modeling, CAD applications including 2-D and 3-D transformations, 3-D viewing, wire frame and solid models, Hidden surface elimination. Program or materials fees may apply. "
    },
    "SE 121A": {
        "prerequisites": [
            "SE 9",
            "and",
            "SE 101A",
            "MAE 130A"
        ],
        "name": "Introduction to Computing for Engineers",
        "description": "Introduction to engineering computing. Interpolation, integration, differentiation. Ordinary differential equations. Nonlinear algebraic equations. Systems of linear algebraic equations. Representation of data in the computer. Use of computer resources. "
    },
    "SE 121B": {
        "prerequisites": [
            "SE 101C",
            "MAE 130C",
            "and",
            "SE 121A"
        ],
        "name": "Computing Projects in Structural Engineering",
        "description": "Exploration of numerical algorithms in engineering computations. Centered around computing projects. Matrix eigenvalue problems, boundary value problems, solution of systems of nonlinear algebraic equations, optimization. Use of computer resources. "
    },
    "SE 125": {
        "prerequisites": [
            "SE majors"
        ],
        "name": "Statistics, Probability and Reliability",
        "description": "Probability theory. Statistics, data analysis and inferential statistics, distributions, confidence intervals. Introduction to structural reliability and random phenomena. Applications to components and systems. "
    },
    "SE 130A–B": {
        "prerequisites": [
            "SE 110A",
            "MAE 131A"
        ],
        "name": "Structural Analysis",
        "description": "Classical methods of analysis for statically indeterminate structures. Development of computer codes for the analysis of civil, mechanical, and aerospace structures from the matrix formulation of the classical structural theory, through the direct stiffness formulation, to production-type structural analysis programs. "
    },
    "SE 131": {
        "prerequisites": [
            "SE 101C",
            "or",
            "MAE 130C",
            "and",
            "SE 121B"
        ],
        "name": "Finite Element Analysis",
        "description": "Development of finite element models based upon the Galerkin method. Application to static and dynamic heat conduction and stress analysis. Formulation of initial boundary value problem models, development of finite element formulas, solution methods, and error analysis and interpretation of results. "
    },
    "SE 140": {
        "prerequisites": [
            "SE 103",
            "SE 130B",
            "and"
        ],
        "name": "Structures and Materials Laboratory",
        "description": "Introduction to concepts, procedures, and key issues of engineering design. Problem formulation, concept design, configuration design, parametric design, and documentation. Project management, team working, ethics, and human factors. Term project in model structure design. Program or materials fees may apply.  ** Upper-division standing required ** "
    },
    "SE 140A": {
        "prerequisites": [
            "SE 130B",
            "and",
            "SE 150"
        ],
        "name": "Professional Issues and Design for Civil Structures I",
        "description": "Part I of multidisciplinary team experience to design, analyze, build, and test civil/geotechnical engineering components and systems considering codes, regulations, alternative design solutions, economics, sustainability, constructability, reliability, and aesthetics. Professionalism, technical communication, project management, teamwork, and ethics in engineering practice. Use of computer resources. Program or materials fees may apply. "
    },
    "SE 140B": {
        "prerequisites": [
            "SE 140A",
            "SE 151A",
            "and",
            "SE 181"
        ],
        "name": "Professional Issues and Design for Civil Structures II",
        "description": "Part II of multidisciplinary team experience to design, analyze, build, and test civil/geotechnical engineering components and systems considering codes, regulations, alternative design solutions, economics, sustainability, constructability, reliability, and aesthetics. Professionalism, technical communication, project management, teamwork, and ethics in engineering practice. Use of computer resources.  Program or materials fees may apply. "
    },
    "SE 142": {
        "prerequisites": [
            "SE 110A",
            "MAE 131A",
            "SE 110B",
            "and",
            "SE 160A"
        ],
        "name": "Design of Composite Structures",
        "description": "Introduction to advanced composite materials and their applications. Fiber and matrix properties, micromechanics, stiffness, ply-by-ply stress, hygrothermal behavior, and failure prediction. Lab activity will involve design, analysis, fabrication, and testing of composite structure. Program or materials fees may apply. "
    },
    "SE 143A": {
        "prerequisites": [
            "SE 3",
            "SE 142",
            "and",
            "SE 160B"
        ],
        "name": "Aerospace Structural Design I",
        "description": "Conceptual and preliminary structural design of aircraft and space vehicles. Minimum-weight design of primary structures based upon mission requirements and configuration constraints. Multicriteria decision making. Team projects include layout, material selection, component sizing, fabrication, and cost. Oral presentations. Written reports. Use of computer resources.  Program or materials fees may apply. "
    },
    "SE 143B": {
        "prerequisites": [
            "SE 143A"
        ],
        "name": "Aerospace Structural Design II",
        "description": "Detailed structural design of aircraft and space vehicles. Composite material design considerations. Multidisciplinary design optimization. Introduction to aerospace computer-aided design and analysis tools. Team projects include the analysis, fabrication, and testing of a flight vehicle component. Oral presentations. Written reports. Use of computer resources.   Program or materials fees may apply. "
    },
    "SE 150": {
        "prerequisites": [
            "SE 130A"
        ],
        "name": "Design of Steel Structures",
        "description": "Design concepts and loadings for structural systems. Working stress, ultimate strength design theories. Properties of structural steel. Elastic design of tension members, beams, and columns. Design of bolted and welded concentric and eccentric connections, and composite floors. Introduction to plastic design. "
    },
    "SE 151A": {
        "prerequisites": [
            "SE 103",
            "and",
            "SE 130A"
        ],
        "name": "Design of Reinforced Concrete",
        "description": "Concrete and reinforcement\n                    properties. Service and ultimate limit state analysis and\n                    design. Design and detailing of structural components. "
    },
    "SE 151B": {
        "prerequisites": [
            "SE 151A"
        ],
        "name": "Design of Prestressed\n                  Concrete",
        "description": "Time-dependent and independent properties of concrete and\n                  reinforcing material. Concept and application of prestressed\n                  concrete. Service and ultimate limit state analysis and design\n                  of prestressed concrete structures and components. Detailing\n                  of components. Calculation of deflection and prestress losses.\n                "
    },
    "SE 152": {
        "prerequisites": [
            "SE 130B",
            "SE 150",
            "and",
            "SE 151A"
        ],
        "name": "Seismic Design of Structures",
        "description": "Seismic design philosophy. Ductility concepts.\n\t\t\t\t  Lateral force resisting systems. Mechanisms of nonlinear deformation.\n\t\t\t\t  Methods of analysis. Detailing of structural steel and reinforced\n\t\t\t\t  concrete elements. Lessons learned from past earthquakes. Multistory\n\t\t\t\t  building design project. "
    },
    "SE 154": {
        "prerequisites": [
            "SE 103",
            "and",
            "SE 130A"
        ],
        "name": "Design of Timber Structures",
        "description": "Properties of wood and lumber grades. Beam design. Design of axially loaded members. Design of beam-column. Properties of plywood and structural-use panels. Design of horizontal diaphragms. Design of shear walls. Design of nailed and bolted connections. "
    },
    "SE 160A": {
        "prerequisites": [
            "SE 2",
            "SE 2L",
            "SE 101B",
            "MAE 130B",
            "and",
            "SE 110A",
            "MAE 131A"
        ],
        "name": "Aerospace Structural Mechanics I",
        "description": "Aircraft and spacecraft flight loads and operational envelopes, three-dimensional stress/strain relations, metallic and composite materials, failure theories, three-dimensional space trusses and stiffened shear panels, combined extension-bend-twist behavior of thin-walled multicell aircraft and space vehicle structures, modulus-weighted section properties, shear center. "
    },
    "SE 160B": {
        "prerequisites": [
            "SE 101C",
            "MAE 130C",
            "and",
            "SE 160A"
        ],
        "name": "Aerospace Structural Mechanics II",
        "description": "Analysis of aerospace structures via work-energy principles and finite element analysis. Bending of metallic and laminated composite plates and shells. Static vibration and buckling analysis of simple and built-up aircraft structures. Introduction to wing divergence and flutter, fastener analysis. "
    },
    "SE 163": {
        "prerequisites": [
            "SE 110A",
            "and",
            "SE 110B"
        ],
        "name": "Nondestructive Evaluation",
        "description": "Fourier signal processing, liquid penetrant, elastic wave propagation, ultrasonic testing, impact-echo, acoustic emission testing, vibrational testing, infrared thermography. May be coscheduled with SE 263.  ** Consent of instructor to enroll possible  **"
    },
    "SE 164": {
        "prerequisites": [
            "SE 101C",
            "MAE 130C",
            "and",
            "SE 110A"
        ],
        "name": "Sensors and Data Acquisition for Structural Engineering",
        "description": "This course discusses theory, design, and applications of sensor technologies in the context of structural engineering and structural health monitoring. Topics include sensors and sensing mechanisms; measurement uncertainty; signal conditioning and interface circuits; data acquisition; analog/digital circuits; and emerging sensors. May be coscheduled with SE 264. "
    },
    "SE 165": {
        "prerequisites": [
            "MAE 130C"
        ],
        "name": "Structural Health Monitoring",
        "description": "A modern paradigm of structural health monitoring as it applies to structural and mechanical systems is presented. Concepts in data acquisition, feature extraction, data normalization, and statistical modeling will be introduced in an integrated context. Matlab-based exercise. Term project. Use of computer resources. "
    },
    "SE 168": {
        "prerequisites": [
            "SE 101C",
            "MAE 130C",
            "and",
            "SE 131"
        ],
        "name": "Structural System Testing and Model Correlation\n\t\t\t   ",
        "description": "Dynamic/model testing of structures: test planning/execution,\n                  actuation, sensing, and data acquisition, signal processing,\n                  data conditioning, test troubleshooting. Methods of updating\n                  finite element structural models to correlate with dynamic\n                  test results. Model/test correlation assessment in industrial\n                  practice. Knowledge of Matlab strongly encouraged. "
    },
    "SE 171": {
        "prerequisites": [
            "SE 160A"
        ],
        "name": "Aerospace Structures Repair",
        "description": "Review methods used to repair aerospace structures. Emphasis on primary load-bearing airframe structures and analysis/design of substantiate repairs. Identification of structural/corrosion distress, fatigue cracking, damage tolerance, integrity and durability of built-up members, patching, health monitoring. Use of computer resources.  ** Consent of instructor to enroll possible  **"
    },
    "SE 180": {
        "prerequisites": [
            "SE 110A",
            "and",
            "SE 130A"
        ],
        "name": "Earthquake Engineering",
        "description": "Elements of seismicity and seismology. Seismic hazards. Dynamic analysis of structures underground motion. Elastic and inelastic response spectra. Modal analysis, nonlinear time-history analysis. Earthquake resistant design. Seismic detailing. "
    },
    "SE 181": {
        "prerequisites": [
            "SE 110A",
            "or",
            "MAE 131A"
        ],
        "name": "Geotechnical Engineering",
        "description": "General introduction to physical and engineering properties of soils. Soil classification and identification methods. Compaction and construction control. Total and effective stress. Permeability, seepage, and consolidation phenomena. Shear strength of sand and clay. "
    },
    "SE 182": {
        "prerequisites": [
            "SE 181"
        ],
        "name": "Foundation Engineering",
        "description": "Application of soil mechanics to the analysis, design, and construction of foundations for structures. Soil exploration, sampling, and in situ testing techniques. Stress distribution and settlement of structures. Bearing capacities of shallow foundations and effects on structural design. Analysis of axial and lateral capacity of deep foundations, including drilled piers and driven piles. "
    },
    "SE 184": {
        "prerequisites": [
            "SE 181"
        ],
        "name": "Ground Improvement",
        "description": "Concepts underpinning mechanical, hydraulic, chemical and inclusion-based methods of ground improvement will be discussed. Students will be able to understand the advantages, disadvantages and limitations of the various methods; and develop a conceptual design for the most appropriate improvement strategy. "
    },
    "SE 192": {
        "prerequisites": [
            "SE major"
        ],
        "name": "Senior Seminar",
        "description": "The Senior Seminar is designed to allow senior undergraduates to meet with faculty members to explore an intellectual topic in structural engineering. Topics will vary from quarter to quarter. Enrollment is limited to twenty students with preference given to seniors.  ** Consent of instructor to enroll possible  **"
    },
    "SE 195": {
        "prerequisites": [],
        "name": "Teaching",
        "description": "Teaching and tutorial assistance in a SE course under supervision of instructor. Not more than four units may be used to satisfy graduation requirements. (P/NP grades only.)  ** Consent of instructor to enroll possible  **"
    },
    "SE 197": {
        "prerequisites": [],
        "name": "Engineering Internship",
        "description": "An enrichment program, available to a limited number of undergraduate students, which provides work experience with industry, government offices, etc., under the supervision of a faculty member and industrial supervisor. Coordination of the Engineering Internship is conducted through UC San Diego’s Academic Internship Program.  ** Consent of instructor to enroll possible  **"
    },
    "SE 198": {
        "prerequisites": [],
        "name": "Directed Study Group",
        "description": "Directed group study, on a topic or in a field not included in the regular department curriculum, by special arrangement with a faculty member. (P/NP grades only.)  ** Consent of instructor to enroll possible  **"
    },
    "SE 199": {
        "prerequisites": [],
        "name": "Independent Study",
        "description": "Independent reading or research on a problem by special arrangement with a faculty member. (P/NP grades only.)  ** Consent of instructor to enroll possible  **"
    }
}